zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
*   <tr>
*     <td>PMIC</td>
*     <td>Power management integrated circuit. The functions that manage this
*         block are grouped as \ref group_syspm_functions_pmic</td>
*   </tr>
*
*   <tr>
*     <td>LP</td>
*     <td>System low power mode. See the \ref group_syspm_switching_into_lp
*         section for details.</td>
*   </tr>
*
*   <tr>
*     <td>ULP</td>
*     <td>System ultra low power mode. See the
*         \ref group_syspm_switching_into_ulp section for details.</td>
*   </tr>
* </table>
*
* \section group_syspm_section_more_information More Information
* For more information on the SysPm driver,
* refer to the technical reference manual (TRM).
*
* \section group_syspm_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td rowspan="2">5.220</td>
*     <td>Added CY_DISABLE_WARM_BOOT, CY_DISABLE_DEEP_SLEEP_RAM and CY_DISABLE_DEEP_SLEEP_OFF
*         macro options to exclude Warm Boot, DEEPSLEEP-RAM and DEEPSLEEP-OFF related code
*         from the build when these features are not required.</td>
*     <td>Code size optimization for CAT1B devices.</td>
*   </tr>
*   <tr>
*     <td>Fixed \ref Cy_SysPm_SystemEnterUlp, \ref Cy_SysPm_SystemEnterLp,
*         \ref Cy_SysPm_SystemEnterMf and \ref Cy_SysPm_SystemEnterOd functions
*         logic to always set the LDO voltage.</td>
*     <td>Bug fixes.</td>
*   </tr>
*   <tr>
*     <td>5.210</td>
*     <td>Added CM7_2 and CM7_3 power status support in
*         \ref Cy_SysPm_ReadStatus,
*         \ref Cy_SysPm_Cm7IsActive,
*         \ref Cy_SysPm_Cm7IsSleep, and
*         \ref Cy_SysPm_Cm7IsDeepSleep APIs.</td>
*     <td>Support added for M7CPUSS version 2 devices with CM7_2 and CM7_3 cores.</td>
*   </tr>
*   <tr>
*     <td>5.200</td>
*     <td>Fixed the compatibility issues encountered when building projects in EWARM using the "C++ only" option.</td>
*     <td>Bug fixes.</td>
*   </tr>
*   <tr>
*     <td>5.190</td>
*     <td>Updated \ref Cy_SysPm_GetHibernateWakeupCause and added new wake event
*         to \ref cy_en_syspm_hibernate_wakeup_source_t.</td>
*     <td>Code enhancements.</td>
*   </tr>
*   <tr>
*     <td>5.180</td>
*     <td>Updated APIs:
*         \ref Cy_SysPm_Init
*         \ref Cy_SysPm_SetDeepSleepMode
*         \ref Cy_SysPm_GetDeepSleepMode
*         \ref Cy_SysPm_CpuEnterDeepSleep
*         \ref Cy_SysPm_CoreBuckStatus
*         \ref Cy_SysPm_RetLdoStatus
*         \ref Cy_SysPm_SramLdoStatus
*         \ref Cy_SysPm_MiscLdoStatus
*         \ref Cy_SysPm_IsSystemLp
*         \ref Cy_SysPm_IsSystemUlp
*         \ref Cy_SysPm_IsSystemHp </td>
*     <td>Code improvements and new functionality for CAT1D devices.</td>
*   </tr>
*   <tr>
*     <td>5.170</td>
*     <td>Updated API \ref Cy_SysPm_ReadStatus for MPN defined supported core checks.</td>
*     <td>Code improvements and bug fixes.</td>
*   </tr>
*   <tr>
*     <td rowspan="3">5.160</td>
*     <td>Updated APIs:
*         \ref Cy_SysPm_CpuEnterSleep
*         \ref Cy_SysPm_CpuEnterDeepSleep
*         \ref Cy_SysPm_RestoreRegisters
*         \ref Cy_SysPm_SetDeepSleepMode </td>
*     <td>Code improvements and bug fixes.</td>
*   </tr>
*   <tr>
*     <td>Updated enumerators: \ref cy_en_syspm_hvldo_voltage_t.</td>
*     <td>Fixed enumerator's names to represent an actual HVLDO configuration.</td>
*   </tr>
*   <tr>
*     <td>Newly added APIs \ref Cy_SysPm_SetPPUDeepSleepMode.</td>
*     <td>Added low power configuration for CAT1D devices.</td>
*   </tr>
*   <tr>
*     <td>5.150</td>
*     <td>Updated Cy_SysPm_SaveRegisters and Cy_SysPm_RestoreRegisters to support parts which do not implement UDB.</td>
*     <td>Added support for FX3G2 (CAT1A).</td>
*   </tr>
*   <tr>
*     <td>5.140</td>
*     <td>Update to cy_en_syspm_hibernate_wakeup_source_t.</td>
*     <td>Minor defect fixing.</td>
*   </tr>
*   <tr>
*     <td>5.130</td>
*     <td>Added support for new device.</td>
*     <td>Added support for TRAVEO&trade; II Cluster (CAT1C).</td>
*   </tr>
*   <tr>
*     <td>5.120</td>
*     <td>Added support for new device.</td>
*     <td>Added support for PSOC C3 (CAT1B).</td>
*   </tr>
*   <tr>
*     <td>5.110</td>
*     <td>Newly Added API Cy_BTSS_PowerDepResetCount  and updated \ref Cy_BTSS_PowerDep.</td>
*     <td>Fixed race condition in PDCM locking/release.</td>
*   </tr>
*   <tr>
*     <td>5.100</td>
*     <td>Added support for TRAVEO&trade; II Body Entry devices.<br>
*         Pre-processor check for MXS40SRSS version now groups ver. 2 with ver. 3. Previously ver. 2 was grouped with ver. 1.</td>
*         API Cy_SysPm_IsDeepSleepRegEnabled is now only available for ULP variant devices.<br>
*         API Cy_SysPm_ReghcSelectMode is now only available for devices with REGHC or HTRREGHC. Previously all MXS40SRSSv3 devices.<br>
*         API Cy_SysPm_PmicEnable is now only available for MXS40SRSSv1 devices, or if BACKUP_VBCK IP is present.</td>
*     <td>Code enhancement and support for new devices.</td>
*   </tr>
*   <tr>
*     <td>5.95</td>
*     <td>Added new APIs Cy_SysPm_StoreDSContext_Wfi, \ref Cy_SysPm_TriggerXRes and few macros.</td>
*     <td>Code enhancements .</td>
*   </tr>
*   <tr>
*     <td rowspan="5">5.94</td>
*     <td> Newly added APIs \ref Cy_SysPm_SetSOCMemPartActivePwrMode, \ref Cy_SysPm_SetSOCMemPartDsPwrMode, \ref Cy_SysPm_GetSOCMemSramPartActivePwrMode, \ref Cy_SysPm_GetSOCMemSramPartDsPwrMode </td>
*     <td>Support of SOCMEM control for CAT1D devices added .</td>
*   </tr>
*   <tr>
*     <td>Newly added APIs \ref Cy_SysPm_ReghcConfigure, \ref Cy_SysPm_ReghcDeConfigure.</td>
*     <td>Added REGHC configuration support for CAT1C devices .</td>
*   </tr>
*   <tr>
*     <td>Newly added APIs \ref Cy_SysPm_SetSysDeepSleepMode, \ref Cy_SysPm_SetAppDeepSleepMode, \ref cy_pd_ppu_set_static_power_mode.</td>
*     <td>DEEPSLEEP support for CAT1D devices added.</td>
*   </tr>
*   <tr>
*     <td>Newly added APIs \ref Cy_SysPm_Cm33IsActive, \ref Cy_SysPm_Cm33IsSleep, \ref Cy_SysPm_Cm33IsDeepSleep, \ref Cy_SysPm_Cm55IsActive, \ref Cy_SysPm_Cm55IsSleep.</td>
*     <td>Support for Core status check added for CAT1D devices .</td>
*   </tr>
*   <tr>
*     <td>Newly added APIs \ref Cy_SysPm_SramLdoEnable, \ref Cy_SysPm_SramLdoSetVoltage, \ref Cy_SysPm_SramLdoGetVoltage.</td>
*     <td>Support for SRAMLDO Regulator added for CAT1D devices .</td>
*   </tr>
*   <tr>
*     <td>5.93</td>
*     <td>Bug fix in definition of LPCOMP1 as wake-up source.</td>
*     <td>The low power comparator #1 was unable to wake-up the system from hibernate state.</td>
*   </tr>
*   <tr>
*     <td>5.92</td>
*     <td>Support for CAT1D devices is added</td>
*     <td>New devices support added</td>
*   </tr>
*   <tr>
*     <td>5.91</td>
*     <td>Updated \ref Cy_SysPm_Init() function.</td>
*     <td>To remove the clearing of reset reason.</td>
*   </tr>
*   <tr>
*     <td>5.90</td>
*     <td>
*           Added new function \ref Cy_SysPm_SetupDeepSleepRAM().
*     </td>
*     <td>Added support for DSRAM Setup for CAT1B devices.</td>
*   </tr>
*   <tr>
*     <td rowspan="4">5.80</td>
*     <td>
*         Support for CAT1C devices.
*     </td>
*     <td>Power Management support for CAT1C devices.</td>
*   <tr>
*     <td>New API's Added/Modified
*         * Cy_SysPm_IsBgRefCtrl()
*         * Cy_SysPm_BgRefCtrl()
*         * Cy_SysPm_LdoSetMode()
*         * Cy_SysPm_LdoGetMode()
*         * Cy_SysPm_LdoIsEnabled()
*         * Cy_SysPm_Cm7IsActive()
*         * Cy_SysPm_Cm7IsSleep()
*         * Cy_SysPm_Cm7IsDeepSleep()
*         * Cy_SysPm_Cm7IsLowPower()
*         * Cy_SysPm_Cm0IsActive()
*         * Cy_SysPm_Cm0IsSleep()
*         * Cy_SysPm_Cm0IsLowPower()
*         * Cy_SysPm_Cm0IsDeepSleep()
*         * Cy_SysPm_IsSystemLp()
*         * Cy_SysPm_PmicEnable()
*         * Cy_SysPm_PmicDisable()
*         * Cy_SysPm_PmicAlwaysEnable()
*         * Cy_SysPm_PmicEnableOutput()
*         * Cy_SysPm_PmicDisableOutput()
*         * Cy_SysPm_PmicLock()
*         * Cy_SysPm_PmicUnlock()
*         * Cy_SysPm_PmicIsEnabled()
*         * Cy_SysPm_PmicIsOutputEnabled()
*         * Cy_SysPm_PmicIsLocked()
*         * Cy_SysPm_OvdEnable()
*         * Cy_SysPm_OvdDisable()
*         * Cy_SysPm_OvdVdddSelect()
*         * Cy_SysPm_OvdVddaSelect()
*         * Cy_SysPm_OvdActionSelect()
*         * Cy_SysPm_BodEnable()
*         * Cy_SysPm_BodDisable()
*         * Cy_SysPm_BodVdddSelect()
*         * Cy_SysPm_BodVddaSelect()
*         * Cy_SysPm_BodActionSelect()
*         * Cy_SysPm_SupplySupervisionStatus()
*         * Cy_SysPm_SystemIsMinRegulatorCurrentSet()
*         * Cy_SysPm_LinearRegDisable()
*         * Cy_SysPm_LinearRegEnable()
*         * Cy_SysPm_LinearRegGetStatus()
*         * Cy_SysPm_DeepSleepRegDisable()
*         * Cy_SysPm_DeepSleepRegEnable()
*         * Cy_SySPm_IsDeepSleepRegEnabled()
*         * Cy_SysPm_ReghcSelectMode()
*         * Cy_SysPm_ReghcGetMode()
*         * Cy_SysPm_ReghcSelectDriveOut()
*         * Cy_SysPm_ReghcGetDriveOut()
*         * Cy_SysPm_ReghcAdjustOutputVoltage()
*         * Cy_SysPm_ReghcDisableIntSupplyWhileExtActive()
*         * Cy_SysPm_ReghcEnableIntSupplyWhileExtActive()
*         * Cy_SysPm_ReghcDisablePmicEnableOutput()
*         * Cy_SysPm_ReghcEnablePmicEnableOutput()
*         * Cy_SysPm_ReghcEnablePmicStatusInput()
*         * Cy_SysPm_ReghcDisablePmicStatusInput()
*         * Cy_SysPm_ReghcSetPmicStatusWaitTime()
*         * Cy_SysPm_ReghcIsConfigured()
*         * Cy_SysPm_ReghcSetConfigured()
*         * Cy_SysPm_ReghcDisable()
*         * Cy_SysPm_ReghcEnable()
*         * Cy_SysPm_ReghcDisablePmicStatusTimeout()
*         * Cy_SysPm_ReghcEnablePmicStatusTimeout()
*         * Cy_SysPm_ReghcIsEnabled()
*         * Cy_SysPm_ReghcIsStatusOk()
*         * Cy_SysPm_ReghcIsSequencerBusy()
*         * Cy_SysPm_ReghcDisableVAdj()
*         * Cy_SysPm_ReghcEnableVAdj()
*         * Cy_SysPm_ReghcDisablePmicInDeepSleep()
*         * Cy_SysPm_ReghcEnablePmicInDeepSleep()
*         * Cy_SysPm_ReghcIsOcdWithinLimits()
*         * Cy_SysPm_ReghcIsCircuitEnabledAndOperating()
*
*     </td>
*     <td>New API's to handle CAT1C devices.</td>
*   <tr>
*     <td>Added \ref group_syspm_functions_ovd, \ref group_syspm_functions_bod, \ref group_syspm_functions_linearreg and \ref group_syspm_functions_reghc API's.</td>
*     <td>New API's to handle Power Management in CAT1C Devices.</td>
*   </tr>
*   <tr>
*     <td>
*           Added following functions for BTSS IP Reset:
*           \ref Cy_BTSS_AssertReset(), \ref Cy_BTSS_IsResetAsserted(),
*     </td>
*     <td>Added API's to support for BTSS IP Reset.</td>
*   </tr>
*   <tr>
*     <td rowspan="3">5.70</td>
*     <td>
*         Support for CAT1B devices.
*     </td>
*     <td>Power Management support for CAT1B devices.</td>
*   <tr>
*     <td>New API's Added
*         * Cy_SysPm_Init()
*         * Cy_SysPm_SystemLpActiveEnter()
*         * Cy_SysPm_SystemLpActiveExit()
*         * Cy_SysPm_IsSystemLpActiveEnabled()
*         * Cy_SysPm_SetDeepSleepMode()
*         * Cy_SysPm_GetDeepSleepMode()
*         * Cy_SysPm_GetBootMode()
*         * Cy_SysPm_TriggerSoftReset()
*         * Cy_SysPm_GetHibernateWakeupCause()
*         * Cy_SysPm_ClearHibernateWakeupCause()
*         * Cy_SysPm_CoreBuckSetVoltage()
*         * Cy_SysPm_CoreBuckGetVoltage()
*         * Cy_SysPm_CoreBuckSetMode()
*         * Cy_SysPm_CoreBuckGetMode()
*         * Cy_SysPm_CoreBuckConfig()
*         * Cy_SysPm_CoreBuckStatus()
*         * Cy_SysPm_LdoExtraRequesterConfig()
*         * Cy_SysPm_SdrConfigure()
*         * Cy_SysPm_SdrSetVoltage()
*         * Cy_SysPm_SdrGetVoltage()
*         * Cy_SysPm_SdrEnable()
*         * Cy_SysPm_IsSdrEnabled()
*         * Cy_SysPm_HvLdoConfigure()
*         * Cy_SysPm_HvLdoSetVoltage()
*         * Cy_SysPm_HvLdoGetVoltage()
*         * Cy_SysPm_HvLdoEnable()
*         * Cy_SysPm_IsHvLdoEnabled()
*         * Cy_SysPm_IoUnfreeze()
*         * Cy_SysPm_DeepSleepIoIsFrozen()
*         * Cy_SysPm_DeepSleepIoUnfreeze()
*         * Cy_SysPm_BackupWordStore()
*         * Cy_SysPm_BackupWordReStore()
*         * Cy_SysPm_CpuEnterRAMOffDeepSleep()
*
*     </td>
*     <td>New API's to handle CAT1B devices.</td>
*   <tr>
*     <td>Added \ref group_syspm_ppu, \ref group_syspm_pdcm and \ref group_syspm_btss API's.</td>
*     <td>New API's to handle Power Management in CAT1B Devices.</td>
*   </tr>
*   </tr>
*   <tr>
*     <td rowspan="2">5.60</td>
*     <td>
*         For PSoC64 device, allow CM0+ to call CY_PRA_FUNCTION_CALL_X_X API in functions
*         accessing FUNCTION_POLICY registers. So that System Configuration structure is
*         updated with new parameters.
*     </td>
*     <td>For PSoC64 device, System configuration can be done from CM0+ application.</td>
*   </tr>
*   <tr>
*     <td>Fixed MISRA 2012 violations.</td>
*     <td>MISRA 2012 compliance.</td>
*   </tr>
*   <tr>
*     <td>5.50</td>
*     <td>
*           Added following functions for SRAM power mode configuration:
*           \ref Cy_SysPm_SetSRAMMacroPwrMode(), \ref Cy_SysPm_SetSRAMPwrMode(),
*           \ref Cy_SysPm_GetSRAMMacroPwrMode(). For PSoC 64 devices these
*           functions can return PRA driver status value.
*     </td>
*     <td>Added support for SRAM power mode configuration.</td>
*   </tr>
*   <tr>
*     <td>5.40</td>
*     <td>Support for CM33.</td>
*     <td>New devices support.</td>
*   </tr>
*   <tr>
*     <td rowspan="3">5.30</td>
*     <td>
*           Updated \ref Cy_SysPm_LdoSetVoltage() and Cy_SysPm_SystemSetMinRegulatorCurrent()
*           to extend the wakeup delay from Deep Sleep for 1.1 V LDO for the case when system
*           regulator is configured to the minimum current mode. Please refer to
*           \ref group_syspm_system_reg_curr_mode for the more details on system regulator modes.
*     </td>
*     <td>Ensure valid VCCD upon wakeup for the system regulator's minimum current mode.</td>
*   </tr>
*   <tr>
*     <td>Fixed MISRA 2012 violations.</td>
*     <td>MISRA 2012 compliance.</td>
*   </tr>
*   <tr>
*     <td>Updated the \ref Cy_SysPm_CpuEnterDeepSleep() function to ensure the Low-power mode
*         entry abort when a system call initiated by Cortex-M4 or Cortex-M0+ is pending.</td>
*     <td>Fixed the issue when the non-blocking flash write initiated by the Cortex-M4 application
*         fails to complete because the Cortex-M0+ CPU is in Deep Sleep mode.</td>
*   </tr>
*   <tr>
*     <td>5.20</td>
*     <td>
*           Updated \ref Cy_SysPm_CpuEnterDeepSleep() function for
*           the CYB06xx7 devices.
*     </td>
*     <td>Added CYB06xx7 device support.</td>
*   </tr>
*   <tr>
*     <td rowspan="3">5.10</td>
*     <td>
*           Updated the following functions for the PSoC 64 devices:
*           \ref Cy_SysPm_CpuEnterDeepSleep(), \ref Cy_SysPm_SystemEnterLp(),
*           \ref Cy_SysPm_SystemEnterUlp, \ref Cy_SysPm_SystemEnterHibernate,
*           \ref Cy_SysPm_SetHibernateWakeupSource,
*           \ref Cy_SysPm_ClearHibernateWakeupSource,
*           \ref Cy_SysPm_SystemSetMinRegulatorCurrent,
*           \ref Cy_SysPm_SystemSetNormalRegulatorCurrent,
*           \ref Cy_SysPm_LdoSetVoltage, \ref Cy_SysPm_LdoSetMode,
*           \ref Cy_SysPm_BuckEnable, \ref Cy_SysPm_BuckSetVoltage1,
*           Following functions are updated as unavailable for PSoC 64 devices:
*           \ref Cy_SysPm_WriteVoltageBitForFlash, \ref Cy_SysPm_SaveRegisters,
*           \ref Cy_SysPm_RestoreRegisters,
*           \ref Cy_SysPm_BuckSetVoltage2, \ref Cy_SysPm_BuckEnableVoltage2,
*           \ref Cy_SysPm_BuckDisableVoltage2,
*           \ref Cy_SysPm_BuckSetVoltage2HwControl, SetReadMarginTrimUlp,
*           SetReadMarginTrimLp, SetWriteAssistTrimUlp, IsVoltageChangePossible.
*     </td>
*     <td>
*           Added PSoC 64 device support.
*     </td>
*   </tr>
*   <tr>
*     <td>
*           For PSoC 64 devices the following functions can return PRA driver
*           status value:
*           \ref Cy_SysPm_CpuEnterDeepSleep(),
*           \ref Cy_SysPm_SystemEnterHibernate(),
*           \ref Cy_SysPm_SystemEnterLp(),
*           \ref Cy_SysPm_SystemEnterUlp(),
*           \ref Cy_SysPm_SystemSetMinRegulatorCurrent(),
*           \ref Cy_SysPm_SystemSetNormalRegulatorCurrent(),
*           \ref Cy_SysPm_LdoSetVoltage(), \ref Cy_SysPm_LdoSetMode(),
*           \ref Cy_SysPm_BuckEnable(), \ref Cy_SysPm_BuckSetVoltage1(),
*     </td>
*     <td>
*           For PSoC 64 devices the SysPm driver uses the PRA driver to change
*           the protected registers. A SysPm driver function that calls a PRA
*           driver function will return the PRA error status code if the called
*           PRA function returns an error. In these cases, refer to PRA return
*           statuses \ref cy_en_pra_status_t.
*     </td>
*   </tr>
*   <tr>
*     <td>Minor documentation updates.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
*   <tr>
*     <td>5.0</td>
*     <td>
*           Updated the internal IsVoltageChangePossible() function
*           (\ref Cy_SysPm_LdoSetVoltage(), \ref Cy_SysPm_BuckEnable(),
*           \ref Cy_SysPm_BuckSetVoltage1(), \ref Cy_SysPm_SystemEnterUlp()
*           and \ref Cy_SysPm_SystemEnterLp() functions are affected).
*           For all the devices except CY8C6xx6 and CY8C6xx7 added the check if
*           modifying the RAM trim register is allowed.
*     </td>
*     <td>
*           Protecting the system from a possible CPU hard-fault cause. If you
*           are using PC > 0 in your project and you want to switch the power
*           modes (LP<->ULP), you need to unprotect the CPUSS_TRIM_RAM_CTL and
*           CPUSS_TRIM_ROM_CTL registers and can use a programmable PPU for that.
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="2">4.50</td>
*     <td>Updated the \ref Cy_SysPm_CpuEnterDeepSleep() function.</td>
*     <td>
*           Updated the mechanism for saving/restoring not retained UDB and clock
*           registers in the Cy_SysPm_CpuEnterDeepSleep() function.
*     </td>
*   </tr>
*   <tr>
*     <td>
*           Updated the \ref Cy_SysPm_CpuEnterDeepSleep() function to use values
*           stored into the variable instead of reading them directly from
*           SFLASH memory.
*     </td>
*     <td>
*           SFLASH memory can be unavailable to read the correct value after
*           a Deep sleep state on the CY8C6xx6 and CY8C6xx7 devices.
*     </td>
*   </tr>
*   <tr>
*     <td>4.40</td>
*     <td>
*           Fixed \ref Cy_SysPm_LdoSetVoltage(), \ref Cy_SysPm_BuckEnable(), and
*           \ref Cy_SysPm_BuckSetVoltage1() functions. Corrected the sequence for
*           setting the RAM trim value. This behavior is applicable for all
*           devices, except CY8C6xx6 and CY8C6xx7.
*     </td>
*     <td>
*           For all devices, except CY8C6xx6 and CY8C6xx7, the trim
*           sequence was setting incorrect trim values for RAM.
*           This could cause a CPU hard fault.
*     </td>
*   </tr>
*   <tr>
*     <td>4.30</td>
*     <td>
*           Corrected the \ref Cy_SysPm_CpuEnterDeepSleep() function.
*           Removed early access to flash values after system Deep Sleep, when
*           flash is not ready to be used. Now the \ref Cy_SysPm_CpuEnterDeepSleep()
*           function does not access flash until the flash is ready.
*           This behavior is applicable only on multi-CPU devices CY8C6xx6 and
*           CY8C6xx7.
*     </td>
*     <td>
*           For CY8C6xx6 and CY8C6xx7 early access to flash values after
*           system Deep Sleep could potentially cause hard fault.
*           Now after system Deep Sleep only ram values are used before
*           flash is ready.
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="3">4.20</td>
*     <td>Updated the \ref Cy_SysPm_RegisterCallback() function.
*         Added a new element to callback structure -
*         cy_stc_syspm_callback_t.order</td>
*     <td>Enhanced the mechanism of callbacks registration and execution. Now
*         callbacks can be ordered during registration. This means the
*         execution flow now is based on cy_stc_syspm_callback_t.order.
*         For more details, see the \ref group_syspm_cb_registering section. </td>
*   </tr>
*   <tr>
*     <td>Updated \ref group_syspm_cb section.
*         Added \ref group_syspm_cb_registering section</td>
*     <td>Added explanations how to use updated callbacks registration
*         mechanism. </td>
*   </tr>
*   <tr>
*     <td>Added new function  \ref Cy_SysPm_GetFailedCallback()</td>
*     <td>Added new functionality to support callback debugging</td>
*   </tr>
*   <tr>
*     <td>4.10.1</td>
*     <td>
*           Updated the Cy_SysPm_BackupEnableVoltageMeasurement() description
*     </td>
*     <td>
*           Changed the scale number from 40% to 10% to correctly reflect a real value.
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="3">4.10</td>
*     <td>Updated the \ref Cy_SysPm_CpuEnterDeepSleep() function.</td>
*     <td>
*         Corrected the mechanism for saving/restoring not retained UDB
*         registers in the Cy_SysPm_CpuEnterDeepSleep() function.
*
*         Now, the \ref Cy_SysPm_CpuEnterDeepSleep() function does not put CM0+ CPU
*         into Deep Sleep and returns \ref CY_SYSPM_SYSCALL_PENDING status, if a
*         syscall operation is pending. This behavior is applicable on multi-CPU
*         devices except CY8C6xx6 and CY8C6xx7.
*     </td>
*   </tr>
*   <tr>
*     <td>Updated the \ref Cy_SysPm_CpuEnterSleep() function.</td>
*     <td>Removed the redundant second call of the WFE() instruction on CM4 CPU.
*         This change is applicable for all devices except CY8C6xx6,
*         CY8C6xx7.
*    </td>
*   </tr>
*   <tr>
*     <td>Added a new \ref CY_SYSPM_SYSCALL_PENDING return status. </td>
*     <td>Expanded driver return statuses for indicating new possible events in
*         the driver.
*     </td>
*   </tr>
*   </tr>
*   <tr>
*     <td rowspan="6">4.0</td>
*     <td>
*          Flattened the organization of the driver source code into the single
*          source directory and the single include directory.
*     </td>
*     <td>Driver library directory-structure simplification.</td>
*   </tr>
*   <tr>
*     <td>
*          Changed power modes names. See \ref group_syspm_system_power_modes.
*
*          Renamed the following functions:
*           - Cy_SysPm_Sleep to Cy_SysPm_CpuEnterSleep
*           - Cy_SysPm_DeepSleep to Cy_SysPm_CpuEnterDeepSleep
*           - Cy_SysPm_Hibernate to Cy_SysPm_SystemEnterHibernate
*           - Cy_SysPm_SleepOnExit to Cy_SysPm_CpuSleepOnExit
*           - Cy_SysPm_EnterLowPowerMode to Cy_SysPm_SystemSetMinRegulatorCurrent
*           - Cy_SysPm_ExitLowPowerMode to Cy_SysPm_SystemSetNormalRegulatorCurrent
*           - Cy_SysPm_IsLowPower to Cy_SysPm_IsSystemUlp
*
*          For all renamed functions, added BWC macros to simplify migration.
*     </td>
*     <td>Device power modes simplification</td>
*   </tr>
*   <tr>
*     <td>
*         Added the following functions:
*          - Cy_SysPm_LdoSetMode
*          - Cy_SysPm_LdoGetMode
*          - Cy_SysPm_WriteVoltageBitForFlash
*          - Cy_SysPm_SaveRegisters
*          - Cy_SysPm_RestoreRegisters
*          - Cy_SysPm_CpuSendWakeupEvent
*          - Cy_SysPm_SystemIsMinRegulatorCurrentSet
*          - Cy_SysPm_SystemEnterLp
*          - Cy_SysPm_SystemEnterUlp
*          - Cy_SysPm_IsSystemLp
*     </td>
*     <td>Added new functionality to configure device power modes</td>
*   </tr>
*   <tr>
*     <td>
*          Callback mechanism changes:
*          - Removed the limitation for numbers of registered callbacks. Previously it
*            was possible to register up to 32 callbacks. Now the maximum registered
*            callbacks is not limited by the SysPm driver.
*          - Internal enhancement in callback execution flow.
*          - <b>Changes with BWC issues</b>:
*            -# Removed the <b>mode</b> element from cy_stc_syspm_callback_params_t
