zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
#define CY_BOD_CHECK_ACTION_CFG(bodActionSelect)        (((bodActionSelect) == CY_SYSPM_BOD_ACTION_NOTHING) || \
                                                         ((bodActionSelect) == CY_SYSPM_BOD_ACTION_FAULT) || \
                                                         ((bodActionSelect) == CY_SYSPM_BOD_ACTION_RESET))

/* Macro to validate SUPPLY ENTITY */
/**
* \note
* This macro is available for CAT1C devices.
**/
#define CY_OVD_CHECK_SUPPLY_ENTITY(supplyEntitySelect)  (((supplyEntitySelect) == CY_SYSPM_ENTITY_BOD_VDDD) || \
                                                         ((supplyEntitySelect) == CY_SYSPM_ENTITY_BOD_VDDA) || \
                                                         ((supplyEntitySelect) == CY_SYSPM_ENTITY_BOD_VCCD) || \
                                                         ((supplyEntitySelect) == CY_SYSPM_ENTITY_OVD_VDDD) || \
                                                         ((supplyEntitySelect) == CY_SYSPM_ENTITY_OVD_VDDA) || \
                                                         ((supplyEntitySelect) == CY_SYSPM_ENTITY_OVD_VCCD))

#endif /* (CY_IP_MXS40SRSS_VERSION >= 2) */
#endif /* defined (CY_IP_MXS40SRSS) */

#if !defined(CY_DISABLE_DEEP_SLEEP_RAM)
#define CY_SYSPM_DEEPSLEEP_RAM_VALID(x)     || ((x) == CY_SYSPM_DEEPSLEEP_RAM)
#else
#define CY_SYSPM_DEEPSLEEP_RAM_VALID(x)
#endif

#if !defined(CY_DISABLE_DEEP_SLEEP_OFF)
#define CY_SYSPM_DEEPSLEEP_OFF_VALID(x)     || ((x) == CY_SYSPM_DEEPSLEEP_OFF)
#else
#define CY_SYSPM_DEEPSLEEP_OFF_VALID(x)
#endif

#if defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)

/**
* \note
* This macro is available for CAT1D devices.
**/
#define CY_SYSPM_IS_CALLBACK_TYPE_VALID(type)           (((type) == CY_SYSPM_SLEEP)         || \
                                                         ((type) == CY_SYSPM_DEEPSLEEP)        \
                                                         CY_SYSPM_DEEPSLEEP_RAM_VALID(type)    \
                                                         CY_SYSPM_DEEPSLEEP_OFF_VALID(type) || \
                                                         ((type) == CY_SYSPM_LP) || \
                                                         ((type) == CY_SYSPM_ULP) || \
                                                         ((type) == CY_SYSPM_HP) || \
                                                         ((type) == CY_SYSPM_HIBERNATE))

/* Macro to validate parameters in Cy_SysPm_CoreBuckSetVoltage() & Cy_SysPm_CoreBuckConfig functions */
#define CY_SYSPM_IS_CORE_BUCK_VOLTAGE_VALID(voltage)    (((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_58V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_60V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_62V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_64V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_66V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_68V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_70V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_72V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_74V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_76V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_78V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_80V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_82V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_84V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_86V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_88V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_90V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_92V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_94V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_96V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_98V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_00V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_02V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_04V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_06V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_08V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_10V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_12V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_14V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_16V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_18V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_20V))

/* Macro to validate core buck profile in Cy_SysPm_CoreBuckSetProfile() function */
#define CY_SYSPM_IS_CORE_BUCK_PROFILE_VALID(mode)           (((mode) == CY_SYSPM_CORE_BUCK_PROFILE_HP)     || \
                                                             ((mode) == CY_SYSPM_CORE_BUCK_PROFILE_LP)     || \
                                                             ((mode) == CY_SYSPM_CORE_BUCK_PROFILE_SKIP)     || \
                                                             ((mode) == CY_SYSPM_CORE_BUCK_PROFILE_ULP))

