zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/* Macro to validate parameters in Cy_SysPm_RetLdoConfigure() */
#define CY_SYSPM_IS_RETLDO_VOLTAGE_VALID(voltage)    (((voltage) <= CY_SYSPM_RETLDO_VOLTAGE_LVL_31))

/* Macro to validate parameters in Cy_SysPm_RetLdoConfigure() */
#define CY_SYSPM_IS_RETLDO_GAIN_VALID(voltage)    (((voltage) == CY_SYSPM_RETLDO_GAIN_2) || \
                                                         ((voltage) == CY_SYSPM_RETLDO_GAIN_2_47))

/* Macro to validate parameters in Cy_SysPm_SramLdoConfigure() */
#define CY_SYSPM_IS_SRAMLDO_VOLTAGE_VALID(voltage)    (((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_58V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_60V)  || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_62V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_64V)  || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_66V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_68V)  || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_70V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_72V)  || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_74V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_76V)  || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_78V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_80V)  || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_82V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_84V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_86V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_88V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_90V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_92V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_94V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_96V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_0_98V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_00V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_02V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_04V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_06V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_08V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_10V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_12V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_14V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_16V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_18V) || \
                                                         ((voltage) == CY_SYSPM_SRAMLDO_VOLTAGE_1_20V))

/* Macro to validate parameters in Cy_SysPm_MiscLdoConfigure() */
#define CY_SYSPM_IS_MISCLDO_VOLTAGE_VALID(voltage)    (((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_58V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_60V)  || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_62V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_64V)  || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_66V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_68V)  || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_70V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_72V)  || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_74V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_76V)  || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_78V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_80V)  || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_82V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_84V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_86V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_88V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_90V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_92V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_94V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_96V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_0_98V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_00V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_02V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_04V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_06V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_08V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_10V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_12V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_14V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_16V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_18V) || \
                                                         ((voltage) == CY_SYSPM_MISCLDO_VOLTAGE_1_20V))

/* Macro to validate parameters in Cy_SysPm_MiscLdoConfigure() */
#define CY_SYSPM_IS_MISCLDO_MODE_VALID(mode)    (((mode) == CY_SYSPM_MISCLDO_VCCACT) || \
                                                         ((mode) == CY_SYSPM_MISCLDO_VOUT))


/* Macro to validate parameters in Cy_SysPm_MiscLdoConfigure() */
#define CY_SYSPM_IS_MISCLDO_VCCACT_TRIM_VALID(trim)    (((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_0) || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_5)  || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_10) || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_15)  || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_20) || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_25)  || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_30) || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_35)  || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_MINUS_40) || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_MINUS_35)  || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_MINUS_30) || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_MINUS_25)  || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_MINUS_20) || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_MINUS_15) || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_MINUS_10) || \
                                                         ((trim) == CY_SYSPM_MISCLDO_VCCACT_TRIM_MINUS_5))

