zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
#endif /* defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN) */

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)
/**
* \note
* This macro is available for CAT1B and CAT1D devices.
**/

/* Macro to validate deep sleep modes in Cy_SysPm_CpuEnterDeepSleep() function */
#define CY_SYSPM_IS_DEEPSLEEP_MODE_VALID(mode)             (((mode) == CY_SYSPM_DEEPSLEEP)        \
                                                            CY_SYSPM_DEEPSLEEP_RAM_VALID(mode)    \
                                                            CY_SYSPM_DEEPSLEEP_OFF_VALID(mode))
/* Macro to validate parameters in Cy_SysPm_SetupDeepSleepRAM() function */
#if !defined(CY_DISABLE_DEEP_SLEEP_RAM)
#define CY_SYSPM_IS_DSRAM_CHECK_VALID(dsramCheck)          (((dsramCheck) == CY_SYSPM_PRE_DSRAM) || \
                                                            ((dsramCheck) == CY_SYSPM_POST_DSRAM))
#endif /* !defined(CY_DISABLE_DEEP_SLEEP_RAM) */

/* Macro to validate core buck mode in Cy_SysPm_CoreBuckConfig() function */
#define CY_SYSPM_IS_CORE_BUCK_MODE_VALID(mode)           (((mode) == CY_SYSPM_CORE_BUCK_MODE_LP)     || \
                                                          ((mode) == CY_SYSPM_CORE_BUCK_MODE_HP))

/* Macro to validate SOCMEM SRAM Power modes in Cy_SysPm_SetSOCMemPartitionPwrMode() function */
#define CY_SYSPM_IS_SOCMEM_PWR_MODE_VALID(mode)             (((mode) == CY_SYSPM_SOCMEM_SRAM_ACTIVE_MODE_ON)     || \
                                                            ((mode) == CY_SYSPM_SOCMEM_SRAM_ACTIVE_MODE_OFF) || \
                                                            ((mode) == CY_SYSPM_SOCMEM_SRAM_DS_MODE_RET_ON) || \
                                                            ((mode) == CY_SYSPM_SOCMEM_SRAM_DS_MODE_RET_OFF))

#endif

#if defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN)
/**
* \note
* This macro is available for CAT1B devices.
**/
#define CY_SYSPM_IS_CALLBACK_TYPE_VALID(type)           (((type) == CY_SYSPM_SLEEP)         || \
                                                         ((type) == CY_SYSPM_LPACTIVE_ENTER)|| \
                                                         ((type) == CY_SYSPM_LPACTIVE_EXIT) || \
                                                         ((type) == CY_SYSPM_DEEPSLEEP)        \
                                                         CY_SYSPM_DEEPSLEEP_RAM_VALID(type)    \
                                                         CY_SYSPM_DEEPSLEEP_OFF_VALID(type) || \
                                                         ((type) == CY_SYSPM_HIBERNATE))


/* Macro to validate parameters in Cy_SysPm_CoreBuckSetVoltage() & Cy_SysPm_CoreBuckConfig functions */
#define CY_SYSPM_IS_CORE_BUCK_VOLTAGE_VALID(voltage)    (((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_76V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_78V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_80V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_82V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_84V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_86V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_88V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_90V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_92V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_94V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_96V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_0_98V)  || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_00V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_02V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_04V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_06V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_08V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_10V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_12V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_14V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_16V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_18V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_20V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_22V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_24V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_26V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_28V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_30V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_32V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_34V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_36V) || \
                                                         ((voltage) == CY_SYSPM_CORE_BUCK_VOLTAGE_1_38V))

/* Macro to Enable/Disable Pause on Core Buck Regulator */
#define CY_SYSPM_CORE_BUCK_PAUSE_ENABLE(enable)          CY_REG32_CLR_SET(SRSS_PWR_CBUCK_CTL2, SRSS_PWR_CBUCK_CTL2_CBUCK_PAUSE, \
                                                          enable)

/* Macro to Enable/Disable Override on Core Buck Regulator */
#define CY_SYSPM_CORE_BUCK_OVERRRIDE_ENABLE(enable)          CY_REG32_CLR_SET(SRSS_PWR_CBUCK_CTL2, SRSS_PWR_CBUCK_CTL2_CBUCK_OVERRIDE, \
                                                          enable)

/* Macro to Enable/Disable Copy Settings of Core Buck Regulator*/
#define CY_SYSPM_CORE_BUCK_COPY_SETTINGS_ENABLE(enable)          CY_REG32_CLR_SET(SRSS_PWR_CBUCK_CTL2, SRSS_PWR_CBUCK_CTL2_CBUCK_COPY_SETTINGS, \
                                                          enable)


/* Macro to validate core buck Inrush Limit in Cy_SysPm_CoreBuckConfig() function */
#define CY_SYSPM_IS_CORE_BUCK_INRUSH_LIMIT_VALID(limit)    (((limit) == CY_SYSPM_CORE_BUCK_INRUSH_LIMIT_10)     || \
                                                            ((limit) == CY_SYSPM_CORE_BUCK_INRUSH_LIMIT_100))

/* Macro to validate parameters in Cy_SysPm_LdoSdrConfigure() function */
#define CY_SYSPM_IS_SDR_VOLTAGE_VALID(voltage)          (((voltage) == CY_SYSPM_SDR_VOLTAGE_0_900V) || \
                                                         ((voltage) == CY_SYSPM_SDR_VOLTAGE_1_000V) || \
                                                         ((voltage) == CY_SYSPM_SDR_VOLTAGE_1_100V))

/* Macro to validate parameters in Cy_SysPm_HvLdoConfigure() function */
#define CY_SYSPM_IS_HVLDO_VOLTAGE_VALID(voltage)        (((voltage) == CY_SYSPM_HVLDO_VOLTAGE_1_800V) || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_1_900V)  || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_2_000V) || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_2_100V) || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_2_200V)  || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_2_300V) || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_2_400V)  || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_2_500V) || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_2_600V)  || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_2_700V) || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_2_800V)  || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_2_900V) || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_3_000V)  || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_3_100V) || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_3_200V) || \
                                                         ((voltage) == CY_SYSPM_HVLDO_VOLTAGE_3_300V))

/* Macro to validate if the SDR number in Cy_SysPm_LdoSdrConfigure() function */
#define CY_SYSPM_IS_SDR_NUM_VALID(num)    (((num) == CY_SYSPM_SDR_0)     || \
                                           ((num) == CY_SYSPM_SDR_1))

/* Macro to validate parameters in RAM/ROM TRIM functions */
#define CY_SYSPM_IS_SDR_TRIM_VOLTAGE_VALID(voltage)     (((voltage) == CY_SYSPM_SDR_VOLTAGE_0_900V) || \
                                                         ((voltage) == CY_SYSPM_SDR_VOLTAGE_1_000V)  || \
                                                         ((voltage) == CY_SYSPM_SDR_VOLTAGE_1_100V))

/**
* \note
* This macro is available for CAT1B devices.
**/
/* Macro to validate number of Macros supported in SRAM0 */

