zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/** The define of retained power mode of the CM7_0. This MACRO is deprecated and will be removed in future release. It will give incorrect value for CAT1C devices. */
#define CY_SYSPM_CM7_0_PWR_CTL_PWR_MODE_RETAINED     (2U)

/** The CM7_1 is Active */
#define CY_SYSPM_STATUS_CM7_1_ACTIVE       ((uint32_t) ((uint32_t)0x1U << 12U))

/** The CM7_1 is in Sleep */
#define CY_SYSPM_STATUS_CM7_1_SLEEP        ((uint32_t) ((uint32_t)0x2U << 12U))

/** The CM7_1 is in DeepSleep */
#define CY_SYSPM_STATUS_CM7_1_DEEPSLEEP    ((uint32_t) ((uint32_t)0x4U << 12U))

/** The CM7_1 is Low Power mode. This MACRO is deprecated and will be removed in future release. It will give incorrect value for CAT1C devices. */
#define CY_SYSPM_STATUS_CM7_1_LOWPOWER     ((uint32_t) ((uint32_t)0x80U << 24U))

/** The define of retained power mode of the CM7_1. This MACRO is deprecated and will be removed in future release. It will give incorrect value for CAT1C devices. */
#define CY_SYSPM_CM7_1_PWR_CTL_PWR_MODE_RETAINED     (2U)

#if (CY_IP_M7CPUSS_VERSION == 2)

/** The CM7_2 is Active */
#define CY_SYSPM_STATUS_CM7_2_ACTIVE       ((uint32_t) ((uint32_t)0x1U << 16U))

/** The CM7_2 is in Sleep */
#define CY_SYSPM_STATUS_CM7_2_SLEEP        ((uint32_t) ((uint32_t)0x2U << 16U))

/** The CM7_2 is in DeepSleep */
#define CY_SYSPM_STATUS_CM7_2_DEEPSLEEP    ((uint32_t) ((uint32_t)0x4U << 16U))

/** The CM7_3 is Active */
#define CY_SYSPM_STATUS_CM7_3_ACTIVE       ((uint32_t) ((uint32_t)0x1U << 20U))

/** The CM7_3 is in Sleep */
#define CY_SYSPM_STATUS_CM7_3_SLEEP        ((uint32_t) ((uint32_t)0x2U << 20U))

/** The CM7_3 is in DeepSleep */
#define CY_SYSPM_STATUS_CM7_3_DEEPSLEEP    ((uint32_t) ((uint32_t)0x4U << 20U))

#endif /* CY_IP_M7CPUSS_VERSION == 2 */

#endif /* CY_IP_M7CPUSS */


#if defined (CY_IP_MXS22SRSS)

/** The CM33 is Active */
#define CY_SYSPM_STATUS_CM33_ACTIVE       ((uint32_t) ((uint32_t)0x1U << 16U))

/** The CM33 is in Sleep */
#define CY_SYSPM_STATUS_CM33_SLEEP        ((uint32_t) ((uint32_t)0x2U << 16U))

/** The CM33 is in DeepSleep */
#define CY_SYSPM_STATUS_CM33_DEEPSLEEP    ((uint32_t) ((uint32_t)0x4U << 16U))


/** The CM55 is Active */
#define CY_SYSPM_STATUS_CM55_ACTIVE       ((uint32_t) ((uint32_t)0x1U << 20U))

/** The CM55 is in Sleep */
#define CY_SYSPM_STATUS_CM55_SLEEP        ((uint32_t) ((uint32_t)0x2U << 20U))

/** The CM55 is in DeepSleep */
#define CY_SYSPM_STATUS_CM55_DEEPSLEEP    ((uint32_t) ((uint32_t)0x4U << 20U))

#endif /* defined (CY_IP_MXS22SRSS) */

/** The system is Low Power mode */
#define CY_SYSPM_STATUS_SYSTEM_LP        ((uint32_t) ((uint32_t)0x80U))

/** The system is in Ultra Low Power mode */
#define CY_SYSPM_STATUS_SYSTEM_ULP       ((uint32_t) ((uint32_t)0x08U << 8U))

/** The system is LPACTIVE Power mode */
#define CY_SYSPM_STATUS_SYSTEM_LPACTIVE  ((uint32_t) ((uint32_t)0x08UL << 16U))

#if defined (CY_IP_MXS22SRSS)
/** The system is HP Power mode */
#define CY_SYSPM_STATUS_SYSTEM_HP        ((uint32_t) ((uint32_t)0x08UL << 24U))
#else
/** The system is Medium Frequency Low Power mode */
#define CY_SYSPM_STATUS_SYSTEM_MF        ((uint32_t) ((uint32_t)0x08UL << 24U))
#endif

/** The system is OD Low Power mode */
#define CY_SYSPM_STATUS_SYSTEM_OD        ((uint32_t) ((uint32_t)0x08UL << 28U))

/** The wait time for transition of the device from the Active into
* the LPActive (Low Power Active)
*/
#define CY_SYSPM_ACTIVE_TO_LP_WAIT_US           (1u)

/** The wait delay time which occurs before the Active reference is settled.
* This delay is used in transition of the device from Active into the
* LPACTIVE (Low Power Active) mode
*/
#define CY_SYSPM_LP_TO_ACTIVE_WAIT_BEFORE_US    (8u)

/** The wait delay time which occurs after the Active reference is settled.
* This delay is used in transition the device from Active into the
* LPACTIVE (Low Power Active) mode
*/
#define CY_SYSPM_LP_TO_ACTIVE_WAIT_AFTER_US    (1u)

/** The internal define of the tries number in the Cy_SysPm_ExitLpMode()
* function
 */
#define CY_SYSPM_WAIT_DELAY_TRYES                        (100u)

/** \} group_syspm_return_status */

/** \} group_syspm_macros */

/*******************************************************************************
*       Configuration Structures
*******************************************************************************/

/**
* \addtogroup group_syspm_data_enumerates
* \{
*/

/** The SysPm function return value status definitions. */
typedef enum
{
    CY_SYSPM_SUCCESS         = 0x0U,                                         /**< Successful. */
    CY_SYSPM_BAD_PARAM       = CY_SYSPM_ID | CY_PDL_STATUS_ERROR | 0x01U,    /**< One or more invalid parameters. */
    CY_SYSPM_TIMEOUT         = CY_SYSPM_ID | CY_PDL_STATUS_ERROR | 0x02U,    /**< A time-out occurred. */
    CY_SYSPM_INVALID_STATE   = CY_SYSPM_ID | CY_PDL_STATUS_ERROR | 0x03U,    /**< The operation is not setup or is in an
                                                                                  improper state. */
    CY_SYSPM_CANCELED        = CY_SYSPM_ID | CY_PDL_STATUS_ERROR | 0x04U,    /**< Operation canceled. */
    CY_SYSPM_SYSCALL_PENDING = CY_SYSPM_ID | CY_PDL_STATUS_ERROR | 0x05U,    /**< Canceled due syscall operation pending. */
    CY_SYSPM_FAIL            = CY_SYSPM_ID | CY_PDL_STATUS_ERROR | 0xFFU     /**< Unknown failure. */
} cy_en_syspm_status_t;

/**
* This enumeration is used to initialize the functions wait action. The wait actions can be -
* an interrupt or an event. Refer to the CMSIS for WFE and WFI instruction explanations.
*/
typedef enum
{
    CY_SYSPM_WAIT_FOR_INTERRUPT,    /**< Wait for an interrupt. */
    CY_SYSPM_WAIT_FOR_EVENT         /**< Wait for an event. */
} cy_en_syspm_waitfor_t;

#if defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN)
/**
* This enumeration is used to distinguish between the pre and post checks required during DS-RAM.
*/
/**
* \note
* This enum is available for CAT1B devices.
**/

typedef enum
{
    CY_SYSPM_PRE_DSRAM,             /**< Pre DSRAM Checks. */
    CY_SYSPM_POST_DSRAM             /**< Post DSRAM Checks. */
} cy_en_syspm_dsram_checks_t;
#endif

/** This enumeration is used to configure wakeup sources for the System Hibernate
*   power mode.
*/
#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)
/**
* \note
* This macro is available for CAT1B & CAT1D devices.
**/

