zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
typedef enum
{
    CY_SYSPM_HIBERNATE_NO_SRC       = 0UL,

    /** Wake on a low logic level for the LPComp0. */
    CY_SYSPM_HIBERNATE_LPCOMP0_LOW  = 0x1U,

    /** Wake on a high logic level for the LPComp0. */
    CY_SYSPM_HIBERNATE_LPCOMP0_HIGH = (0x1U << 1),

    /** Wake on a low logic level for the LPComp1. */
    CY_SYSPM_HIBERNATE_LPCOMP1_LOW  = (0x1U << 2),

    /** Wake on a high logic level for the LPComp1. */
    CY_SYSPM_HIBERNATE_LPCOMP1_HIGH = (0x1U << 3),

    /** Configure the RTC alarm as wakeup source. */
    CY_SYSPM_HIBERNATE_RTC_ALARM    = (0x1U << 4),

    /** Configure the WDT interrupt as wakeup source. */
    CY_SYSPM_HIBERNATE_WDT          = (0x1U << 5),

    /** Configure a low logic level for the first wakeup-pin. See device datasheet for specific pin. */
    CY_SYSPM_HIBERNATE_PIN0_LOW     = (0x1U << 6),

    /** Configure a high logic level for the first wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN0_HIGH    = (0x1U << 7),

    /** Configure a low logic level for the second wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN1_LOW     = (0x1U << 8),

    /** Configure a high logic level for the second wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN1_HIGH    = (0x1U << 9)
} cy_en_syspm_hibernate_wakeup_source_t;
#elif defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION == 3u) && defined (CY_IP_MXS40SRSS_VERSION_MINOR) && (CY_IP_MXS40SRSS_VERSION_MINOR >= 3u)

/*  SRSSver3p3 hibernate wakeup pins and polarity are in different registers with the same bit offsets.
    Use a flag to mark the high polarity enum values which does not overlap any fields in the PWR_HIB_WAKE_CTL register */
#define CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG (1UL << 10U)

#if defined(SRSS_NUM_HIB_WAKE) && (SRSS_NUM_HIB_WAKE > 10U)
#error A maximum of 10 hibernate wakeup pins are supported
#endif

/**
* \note
* This macro is available for CAT1C (TVIIC) devices.
**/

typedef enum
{
    CY_SYSPM_HIBERNATE_NO_SRC       = 0UL,

    /** Configure CSV_BAK as wakeup source. */
    CY_SYSPM_HIBERNATE_CSV_BAK      = (0x1UL << 29),

    /** Configure the RTC alarm as wakeup source. */
    CY_SYSPM_HIBERNATE_RTC_ALARM    = (0x1UL << 30),

    /** Configure the WDT interrupt as wakeup source. */
    CY_SYSPM_HIBERNATE_WDT          = ((int32_t)(0x1UL << 31)),

    /** Configure a low logic level for the first wakeup-pin. See device datasheet for specific pin. */
    CY_SYSPM_HIBERNATE_PIN0_LOW     = (0x1UL << 0),

    /** Configure a high logic level for the first wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN0_HIGH    = (0x1UL << 0) | (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 0),

    /** Configure a low logic level for the second wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN1_LOW     = (0x1U << 1),

    /** Configure a high logic level for the second wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN1_HIGH    = (0x1U << 1) | (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 1),

    /** Configure a low logic level for the third wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN2_LOW     = (0x1U << 2),

    /** Configure a high logic level for the third wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN2_HIGH    = (0x1U << 2) | (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 2),

    /** Configure a low logic level for the fourth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN3_LOW     = (0x1U << 3),

    /** Configure a high logic level for the fourth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN3_HIGH    = (0x1U << 3) | (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 3),

    /** Configure a low logic level for the fifth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN4_LOW     = (0x1U << 4),

    /** Configure a high logic level for the fifth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN4_HIGH    = (0x1U << 4) | (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 4),

    /** Configure a low logic level for the sixth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN5_LOW     = (0x1U << 5),

    /** Configure a high logic level for the sixth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN5_HIGH    = (0x1U << 5) | (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 5),

    /** Configure a low logic level for the seventh wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN6_LOW     = (0x1U << 6),

    /** Configure a high logic level for the seventh wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN6_HIGH    = (0x1U << 6) | (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 6),

    /** Configure a low logic level for the eighth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN7_LOW     = (0x1U << 7),

    /** Configure a high logic level for the eighth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN7_HIGH    = (0x1U << 7) | (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 7),

    /** Configure a low logic level for the ninth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN8_LOW     = (0x1U << 8),

    /** Configure a high logic level for the ninth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN8_HIGH    = (0x1U << 8) | (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 8),

    /** Configure a low logic level for the tenth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN9_LOW     = (0x1U << 9),

    /** Configure a high logic level for the tenth wakeup-pin. See device datasheet for specific pin.*/
    CY_SYSPM_HIBERNATE_PIN9_HIGH    = (0x1U << 9) | (CY_SYSPM_HIBERNATE_POLARITY_HIGH_FLAG << 9)

} cy_en_syspm_hibernate_wakeup_source_t;
#else
/**
* \note
* This macro is available for CAT1A and CAT1B devices.
**/
typedef enum
{
    CY_SYSPM_HIBERNATE_NO_SRC       = 0UL,

