zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_GetSRAMMacroPwrMode
****************************************************************************//**
*
* Function to get Power Mode for each of the Macro in a particular SRAM.
*
* \param sramNum
* SRAM's index number has to be passed
* ex: CY_SYSPM_SRAM0_MEMORY or CY_SYSPM_SRAM1_MEMORY or CY_SYSPM_SRAM2_MEMORY
* See \ref cy_en_syspm_sram_index_t.
*
* \param sramMacroNum
* Macro number of a particular SRAM.
*
* \note
* If SRAM1 and SRAM2 consists of single power partition, power mode will be
* applied to whole SRAM region, so 0 must be passed for sramMacroNum parameter,
* and the power mode obtained will be for whole SRAM.
*
* \note
* CAT1B and CAT1D devices do not support CY_SYSPM_SRAM_PWR_MODE_RET, only
* CY_SYSPM_SRAM_PWR_MODE_ON and CY_SYSPM_SRAM_PWR_MODE_OFF power modes are
* supported.
*
* \return
* Returns SRAM power mode. See \ref cy_en_syspm_sram_pwr_mode_t.
*
*******************************************************************************/
cy_en_syspm_sram_pwr_mode_t Cy_SysPm_GetSRAMMacroPwrMode(cy_en_syspm_sram_index_t sramNum, uint32_t sramMacroNum);

/*******************************************************************************
* Function Name: Cy_SysPm_SetSRAMPwrMode
****************************************************************************//**
*
* Function to set Power Mode for all the Macros for a particular SRAM.
*
* \param sramNum
* SRAM's index number has to be passed
* ex: CY_SYSPM_SRAM0_MEMORY or CY_SYSPM_SRAM1_MEMORY or CY_SYSPM_SRAM2_MEMORY
* See \ref cy_en_syspm_sram_index_t.
*
* \param sramPwrMode
* Power Mode that needs to be set.
*
* \return
* - CY_SYSPM_SUCCESS - SRAM power mode is set.
* - CY_SYSPM_BAD_PARAM - Input parameters are out of range.
* See \ref cy_en_syspm_status_t.
*
* \note
* CAT1B and CAT1D devices do not support CY_SYSPM_SRAM_PWR_MODE_RET, only
* CY_SYSPM_SRAM_PWR_MODE_ON and CY_SYSPM_SRAM_PWR_MODE_OFF power modes are
* supported.
*
* For the PSoC 64 devices there are possible situations when function returns
* the PRA error status code. This is because for PSoC 64 devices the function
* uses the PRA driver to change the protected registers. Refer to
* \ref cy_en_pra_status_t for more details.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SetSRAMPwrMode(cy_en_syspm_sram_index_t sramNum, cy_en_syspm_sram_pwr_mode_t sramPwrMode);


#if defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_SetSOCMemPartActivePwrMode
****************************************************************************//**
*
* Set Active mode Power Mode for a particular partition of SRAM in SOCMEM
*
* \param socmemSramPartNum
* SOCMEM- SRAM's Partition Number
* See \ref cy_en_syspm_socmem_sram_partition_index_t.
*
* \param socmemSramPwrMode
* Power Mode that needs to be set.
* See \ref cy_en_syspm_socmem_sram_pwr_mode_t.
*
* \return
* - CY_SYSPM_SUCCESS - SRAM power mode is set.
* - CY_SYSPM_BAD_PARAM - Input parameters are out of range.
* See \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SetSOCMemPartActivePwrMode(cy_en_syspm_socmem_sram_partition_index_t socmemSramPartNum, cy_en_syspm_socmem_sram_pwr_mode_t socmemSramPwrMode);

/*******************************************************************************
* Function Name: Cy_SysPm_SetSOCMemPartDsPwrMode
****************************************************************************//**
*
* Set DS mode Power Mode for a particular partition of SRAM in SOCMEM
*
* \param socmemSramPartNum
* SOCMEM- SRAM's Partition Number
* See \ref cy_en_syspm_socmem_sram_partition_index_t.
*
* \param socmemSramPwrMode
* Power Mode that needs to be set.
* See \ref cy_en_syspm_socmem_sram_pwr_mode_t.
*
* \return
* - CY_SYSPM_SUCCESS - SRAM power mode is set.
* - CY_SYSPM_BAD_PARAM - Input parameters are out of range.
* See \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SetSOCMemPartDsPwrMode(cy_en_syspm_socmem_sram_partition_index_t socmemSramPartNum, cy_en_syspm_socmem_sram_pwr_mode_t socmemSramPwrMode);

/*******************************************************************************
* Function Name: Cy_SysPm_GetSOCMemSramPartActivePwrMode
****************************************************************************//**
*
* Function to get Active mode Power Mode for a particular SOCMEM SRAM Partition
*
* \param socmemSramPartNum
* SOCMEM- SRAM's Partition Number
* See \ref cy_en_syspm_socmem_sram_partition_index_t.
*
* \return
* Returns SRAM power mode. See \ref cy_en_syspm_socmem_sram_pwr_mode_t.
*
*******************************************************************************/
cy_en_syspm_socmem_sram_pwr_mode_t Cy_SysPm_GetSOCMemSramPartActivePwrMode(cy_en_syspm_socmem_sram_partition_index_t socmemSramPartNum);

/*******************************************************************************
* Function Name: Cy_SysPm_GetSOCMemSramPartDsPwrMode
****************************************************************************//**
*
* Function to get DS mode Power Mode for a particular SOCMEM SRAM Partition
*
* \param socmemSramPartNum
* SOCMEM- SRAM's Partition Number
* See \ref cy_en_syspm_socmem_sram_partition_index_t.
*
* \return
* Returns SRAM power mode. See \ref cy_en_syspm_socmem_sram_pwr_mode_t.
*
*******************************************************************************/
cy_en_syspm_socmem_sram_pwr_mode_t Cy_SysPm_GetSOCMemSramPartDsPwrMode(cy_en_syspm_socmem_sram_partition_index_t socmemSramPartNum);


#endif /* defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN) */


#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_WriteVoltageBitForFlash
****************************************************************************//**
*
* Function that changes the voltage setting for flash.
*
* \note
* Call this function before system enters ULP mode. Call this function after
* the system enters LP mode.
*
* \param value
* Value to be set in the flash voltage control register.
* See \ref cy_en_syspm_flash_voltage_bit_t.
*
* \return
* - CY_SYSPM_SUCCESS - The voltage is set.
* - CY_SYSPM_CANCELED - Operation was canceled. Call the function again until
*   the function returns CY_SYSPM_SUCCESS. See \ref cy_en_syspm_status_t.
* \note
* This API is available for CAT1A devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_WriteVoltageBitForFlash
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_WriteVoltageBitForFlash(cy_en_syspm_flash_voltage_bit_t value);

#if !((CY_CPU_CORTEX_M4) && (defined (CY_DEVICE_SECURE)))

