zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_Init
****************************************************************************//**
*
* Initializes SysPm Driver
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_Init(void);
#endif

#if defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_IsLpmReady
****************************************************************************//**
*
* Checks if the system is LPM ready.
*
* \return
* - True if the system is LPM Ready.
* - False if the system is not LPM Ready.
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
bool Cy_SysPm_IsLpmReady(void);
#endif  /* defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined (CY_DOXYGEN) */

#if defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_SystemLpActiveEnter
****************************************************************************//**
*
* Change the system from ACTIVE Profile to LPACTIVE (Low Power Active)/LPSLEEP
* (Low Power Sleep) Profile
*
* \return
* - CY_SYSPM_SUCCESS - Entered the system Low Power mode or
* the device is already in Low Power mode.
* - CY_SYSPM_INVALID_STATE - The system Low Power mode was not set. The
* system Low Power mode was not set because the protection context value is
* higher than zero
*   (PC > 0) or the device revision does not support modifying registers
*   (to enter LP mode) via syscall.
* - CY_SYSPM_CANCELED - Operation was canceled. Call the function again until
*   the function returns CY_SYSPM_SUCCESS.
* - CY_SYSPM_FAIL - The system Low Power mode is not entered.
*
* \note
* This API is available for CAT1B and CAT1C devices.
*
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SystemLpActiveEnter(void);

/*******************************************************************************
* Function Name: Cy_SysPm_SystemLpActiveExit
****************************************************************************//**
*
* Changes the system from LPACTIVE (Low Power Active)/LPSLEEP (Low Power Sleep)
* Profile to ACTIVE Profile
*
* \return
* - CY_SYSPM_SUCCESS - Entered the system Low Power mode or
* the device is already in Low Power mode.
* - CY_SYSPM_INVALID_STATE - The system Low Power mode was not set. The
* system Low Power mode was not set because the protection context value is
* higher than zero
*   (PC > 0) or the device revision does not support modifying registers
*   (to enter LP mode) via syscall.
* - CY_SYSPM_CANCELED - Operation was canceled. Call the function again until
*   the function returns CY_SYSPM_SUCCESS.
* - CY_SYSPM_FAIL - The system Low Power mode is not entered.
*
* \note
* This API is available for CAT1B and CAT1C devices.
*
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SystemLpActiveExit(void);

/*******************************************************************************
* Function Name: Cy_SysPm_IsSystemLpActiveEnabled
****************************************************************************//**
*
* Checks if the system is in LPACTIVE (Low Power Active)/LPSLEEP (Low Power Sleep)
* Profile
*
* \return
* True if enabled, False if disabled.
*
* \note
* This API is available for CAT1B and CAT1C devices.
*
*******************************************************************************/
bool Cy_SysPm_IsSystemLpActiveEnabled(void);
#endif  /* defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined (CY_DOXYGEN) */

/*******************************************************************************
* Function Name: Cy_SysPm_StoreDSContext_Wfi
****************************************************************************//**
*
* Allow users to implement any context store required before entering deep sleep
* in RTOS based builds, It is defined weak to allow callers override the default
* PDL implementation.
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/

#if defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN)
#if !defined(CY_DISABLE_DEEP_SLEEP_RAM)
void Cy_SysPm_StoreDSContext_Wfi(void);
#endif
#endif /* !defined(CY_DISABLE_DEEP_SLEEP_RAM) */

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_SetDeepSleepMode
****************************************************************************//**
*
* Set the deepsleep mode - deepsleep or deepsleep-ram or deepsleep-off
*
* \note
* If mode is set to CY_SYSPM_MODE_DEEPSLEEP_RAM && Application in Flash, user
* needs to take care of below
*
* Two types of images need to be generated
* 1. Flash image
*    - Contains the actual application.
*
* 2. RAM Image(Resides in RAM)
*    - Contains Warmboot Entry Point function.
*    - SMIF initialization is performed only during coldboot, and not in
*      warmboot, so RAM Image will have the code performing SMIF
*      initialization before jumping to Flash Image.
*
* Before entering CY_SYSPM_MODE_DEEPSLEEP_RAM, user need to take care of below
* 1. Entry point
*    - Set entry point to a function located in RAM Image using
*    - Cy_Syslib_SetWarmBootEntryPoint(Syslib Driver)
*
* After waking up from CY_SYSPM_MODE_DEEPSLEEP_RAM, bootrom jumps to
* entry point function located in RAM image code. Entry point function should
* take care of below
*
* 1. Vector table and Peripheral IP's enabling
*    - Set VTOR register with vector table address.
*    - Enable all the peripheral IP's using \ref Cy_SysClk_PeriGroupSetSlaveCtl.
* 2. SMIF Initialization
*    - Perform  SMIF Initialization.
* 3. Jump to API in the Flash.
*
* \param deepSleepMode
* CY_SYSPM_MODE_DEEPSLEEP or CY_SYSPM_MODE_DEEPSLEEP_RAM or CY_SYSPM_MODE_DEEPSLEEP_OFF
*
* \return
* - CY_SYSPM_SUCCESS - Deep sleep mode is set
* - CY_SYSPM_CANCELED - Operation was canceled. Call the function again until
*   the function returns CY_SYSPM_SUCCESS.
*
* \note
* This API is available for CAT1B and CAT1D devices.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SetDeepSleepMode(cy_en_syspm_deep_sleep_mode_t deepSleepMode);

#if defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)

