zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
#if defined (CY_IP_MXS22SRSS) || defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL) || defined (CY_DOXYGEN)

#if defined (CY_IP_MXS22SRSS)
/*******************************************************************************
* Function Name: Cy_SysPm_SystemEnterHp
****************************************************************************//**
*
* Sets device into System High Performance mode.
*
* System HP mode is similar to system LP and ULP mode. The difference is that the
* system is put at voltage which are above LP and ULP.
*
* Before entering system HP mode, the user must configure the system so
* the maximum clock frequencies are at HP mode specifications
* presented in the device datasheet. Refer to the device datasheet for
* the maximum clock limitations in the HP mode with reduced core supply
* regulator voltages.
*
* Prior to entering system HP mode, all the registered CY_SYSPM_HP callbacks
* with CY_SYSPM_CHECK_READY parameter are called. This allows the driver to
* signal if it is not ready to enter system HP mode. If any CY_SYSPM_HP
* callback with the CY_SYSPM_CHECK_READY parameter call returns CY_SYSPM_FAIL,
* the remaining CY_SYSPM_HP callbacks with the CY_SYSPM_CHECK_READY parameter
* are skipped.
*
* After a CY_SYSPM_FAIL, all of the CY_SYSPM_HP callbacks with the
* CY_SYSPM_CHECK_FAIL parameter are executed that correspond to the
* CY_SYSPM_HP callback with CY_SYSPM_CHECK_READY parameter that occurred up to
* the point of failure. System HP mode is not entered
* and the Cy_SysPm_SystemEnterHp() function returns CY_SYSPM_FAIL.
*
* If all CY_SYSPM_HP callbacks with the CY_SYSPM_CHECK_READY
* parameter return CY_SYSPM_SUCCESS, then all CY_SYSPM_HP
* callbacks with CY_SYSPM_CHECK_FAIL calls are skipped and all CY_SYSPM_HP
* callbacks with the CY_SYSPM_BEFORE_TRANSITION parameter are executed. This
* allows preparation for HP. The system HP mode is then entered.
*
* After entering system HP, all of the registered CY_SYSPM_HP callbacks with
* the CY_SYSPM_AFTER_TRANSITION parameter are executed to complete preparing the
* peripherals for HP operation. The Cy_SysPm_SystemEnterUlp() function
* returns CY_SYSPM_SUCCESS. No CY_SYSPM_HP callbacks with the
* CY_SYSPM_BEFORE_TRANSITION or CY_SYSPM_AFTER_TRANSITION parameter are
* executed, if HP mode is not entered.
*
* \note The last callback that returns CY_SYSPM_FAIL is not executed with the
* CY_SYSPM_CHECK_FAIL parameter because of the FAIL. The callback generating
* CY_SYSPM_FAIL is expected to not make any changes that require being undone.
*
* \note CAT1D devices support ULP, LP and HP modes, transitioning between
* ULP <-> HP modes requires LP mode to be entered first and then to the
* required mode.
*
* The return value from executed callback functions with the
* CY_SYSPM_CHECK_FAIL, CY_SYSPM_BEFORE_TRANSITION, and CY_SYSPM_AFTER_TRANSITION
* modes are ignored.
*
* To support control of callback execution order th following method is
* implemented. Callback function with the CY_SYSPM_CHECK_READY and
* CY_SYSPM_BEFORE_TRANSITION parameter are executed in the same order they are
* registered. Callback function with the CY_SYSPM_CHECK_FAIL and
* CY_SYSPM_AFTER_TRANSITION parameter are executed in the reverse order they
* are registered.
*
* \return
* - CY_SYSPM_SUCCESS - Entered the system HP mode or the device is already in HP mode.
* - CY_SYSPM_INVALID_STATE - System HP mode was not set. The HP mode was not
*   set because the protection context value is higher than zero (PC > 0) or the
*   device revision does not support modifying registers (to enter system
*   HP mode) via syscall.
* - CY_SYSPM_CANCELED - Operation was canceled. Call the function again until
*   the function returns CY_SYSPM_SUCCESS.
* - CY_SYSPM_FAIL - The system HP mode is not entered.
*   For the PSoC 64 devices there are possible situations when function returns
*   the PRA error status code. This is because for PSoC 64 devices the function
*   uses the PRA driver to change the protected registers. Refer to
*   \ref cy_en_pra_status_t for more details.
*
* \note
* This API is available only for CAT1D devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_SystemEnterHp
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SystemEnterHp(void);

#endif

#if defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)
/*******************************************************************************
* Function Name: Cy_SysPm_SystemEnterMf
****************************************************************************//**
*
* Sets device into system Medium Frequency(MF) Low Power mode.
*
* System MF mode is similar to system LP and ULP mode. The difference is that the
* system is put under voltage which are in between LP and ULP.
*
* Before entering system MF mode, the user must configure the system so
* the maximum clock frequencies are less than the MF mode specifications
* presented in the device datasheet. Refer to the device datasheet for
* the maximum clock limitations in the MF mode with reduced core supply
* regulator voltages.
*
* Prior to entering system MF mode, all the registered CY_SYSPM_MF callbacks
* with CY_SYSPM_CHECK_READY parameter are called. This allows the driver to
* signal if it is not ready to enter system MF mode. If any CY_SYSPM_MF
* callback with the CY_SYSPM_CHECK_READY parameter call returns CY_SYSPM_FAIL,
* the remaining CY_SYSPM_MF callbacks with the CY_SYSPM_CHECK_READY parameter
* are skipped.
*
* After a CY_SYSPM_FAIL, all of the CY_SYSPM_MF callbacks with the
* CY_SYSPM_CHECK_FAIL parameter are executed that correspond to the
* CY_SYSPM_MF callback with CY_SYSPM_CHECK_READY parameter that occurred up to
* the point of failure. System MF mode is not entered
* and the Cy_SysPm_SystemEnterMf() function returns CY_SYSPM_FAIL.
*
* If all CY_SYSPM_MF callbacks with the CY_SYSPM_CHECK_READY
* parameter return CY_SYSPM_SUCCESS, then all CY_SYSPM_MF
* callbacks with CY_SYSPM_CHECK_FAIL calls are skipped and all CY_SYSPM_MF
* callbacks with the CY_SYSPM_BEFORE_TRANSITION parameter are executed. This
* allows preparation for MF. The system MF mode is then entered.
*
* After entering system MF, all of the registered CY_SYSPM_MF callbacks with
* the CY_SYSPM_AFTER_TRANSITION parameter are executed to complete preparing the
* peripherals for MF operation. The Cy_SysPm_SystemEnterUlp() function
* returns CY_SYSPM_SUCCESS. No CY_SYSPM_MF callbacks with the
* CY_SYSPM_BEFORE_TRANSITION or CY_SYSPM_AFTER_TRANSITION parameter are
* executed, if MF mode is not entered.
*
* \note The last callback that returns CY_SYSPM_FAIL is not executed with the
* CY_SYSPM_CHECK_FAIL parameter because of the FAIL. The callback generating
* CY_SYSPM_FAIL is expected to not make any changes that require being undone.
*
* The return value from executed callback functions with the
* CY_SYSPM_CHECK_FAIL, CY_SYSPM_BEFORE_TRANSITION, and CY_SYSPM_AFTER_TRANSITION
* modes are ignored.
*
* To support control of callback execution order th following method is
* implemented. Callback function with the CY_SYSPM_CHECK_READY and
* CY_SYSPM_BEFORE_TRANSITION parameter are executed in the same order they are
* registered. Callback function with the CY_SYSPM_CHECK_FAIL and
* CY_SYSPM_AFTER_TRANSITION parameter are executed in the reverse order they
* are registered.
*
* \return
* - CY_SYSPM_SUCCESS - Entered the system MF mode or the device is already in MF mode.
* - CY_SYSPM_INVALID_STATE - System MF mode was not set. The MF mode was not
*   set because the protection context value is higher than zero (PC > 0) or the
*   device revision does not support modifying registers (to enter system
*   MF mode) via syscall.
* - CY_SYSPM_CANCELED - Operation was canceled. Call the function again until
*   the function returns CY_SYSPM_SUCCESS.
* - CY_SYSPM_FAIL - The system MF mode is not entered.
*   For the PSoC 64 devices there are possible situations when function returns
*   the PRA error status code. This is because for PSoC 64 devices the function
*   uses the PRA driver to change the protected registers. Refer to
*   \ref cy_en_pra_status_t for more details.
*
* \note
* This API is available only for CAT1B(PSOC C3) devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_SystemEnterMf
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SystemEnterMf(void);


