zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_LdoSetMode
****************************************************************************//**
*
* Configures the core LDO regulator operating mode to one of three modes.
* Disabled - turns off the LDO regulator and should be selected only after the
* Buck regulator is operating. Normal mode configures the LDO for operation at
* the maximum output current limit. Minimal current mode optimizes the LDO at a
* reduced output current limit. Specific device current limits can be found in
* the device datasheet.
*
* \param mode
* The desired LDO regulator operating mode.
* See \ref cy_en_syspm_ldo_mode_t mode
*
* \return
* - CY_SYSPM_SUCCESS - Requested regulator current mode was set
* - CY_SYSPM_CANCELED - The power circuits were not ready to enter into
*   minimum current mode. You should try to call the function again
* - CY_SYSPM_TIMEOUT - Timeout occurred because of active reference was not
*   ready to enter into the normal regulator current mode
* - CY_SYSPM_FAIL - incorrect mode value was passed
*   For the PSoC 64 devices there are possible situations when function returns
*   the PRA error status code. This is because for PSoC 64 devices the function
*   uses the PRA driver to change the protected registers. Refer to
*   \ref cy_en_pra_status_t for more details.
*
* \sideeffect
* For PSoC 64 series devices CY_SYSPM_LDO_MODE_DISABLED mode is not supported.
* Use \ref Cy_SysPm_BuckEnable() instead.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_LdoSetMode(cy_en_syspm_ldo_mode_t mode);


/*******************************************************************************
* Function Name: Cy_SysPm_LdoGetMode
****************************************************************************//**
*
* Returns the current core LDO regulator operating mode.
*
* \return
* The LDO regulator operating mode.
* See \ref cy_en_syspm_ldo_mode_t mode
*
*******************************************************************************/
cy_en_syspm_ldo_mode_t Cy_SysPm_LdoGetMode(void);

/** \} group_syspm_functions_ldo */


/**
* \addtogroup group_syspm_functions_linearreg
* \{
*/
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || (defined (CY_IP_MXS40SSRSS) && (SRSS_S40S_REGSETA_PRESENT == 1UL))

/*******************************************************************************
* Function Name: Cy_SysPm_LinearRegDisable
****************************************************************************//**
*
* Disables internal linear regulator.
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B(PSOC C3), CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_LinearRegDisable(void);

/*******************************************************************************
* Function Name: Cy_SysPm_LinearRegEnable
****************************************************************************//**
*
* Enables internal linear regulator.
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B(PSOC C3), CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_LinearRegEnable(void);


/*******************************************************************************
* Function Name: Cy_SysPm_LinearRegGetStatus
****************************************************************************//**
*
* Check the status of the internal linear regulator.
*
* \return
* true  - status ok
* false - status fail
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B(PSOC C3), CAT1C devices.
*
*******************************************************************************/
bool Cy_SysPm_LinearRegGetStatus(void);


/*******************************************************************************
* Function Name: Cy_SysPm_DeepSleepRegDisable
****************************************************************************//**
*
* Disables internal DeepSleep regulator.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_DeepSleepRegDisable(void);


/*******************************************************************************
* Function Name: Cy_SysPm_DeepSleepRegEnable
****************************************************************************//**
*
* Enables internal DeepSleep regulator.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_DeepSleepRegEnable(void);

/*******************************************************************************
* Function Name: Cy_SySPm_IsDeepSleepRegEnabled
****************************************************************************//**
*
* Checks if internal DeepSleep regulator is enabled or not.
*
* \return
* true  - Enabled
* false - Disabled
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C devices.
*
*******************************************************************************/
bool Cy_SySPm_IsDeepSleepRegEnabled(void);

#endif  /* defined ((CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2) */

/** \} group_syspm_functions_linearreg */

/**
* \addtogroup group_syspm_functions_reghc
* \{
*/
#if (defined (SRSS_S40E_REGHC_PRESENT) && (SRSS_S40E_REGHC_PRESENT == 1u)) || \
    ((defined (SRSS_S40E_HTREGHC_PRESENT) && (SRSS_S40E_HTREGHC_PRESENT == 1u))) || \
    defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcSelectMode
****************************************************************************//**
*
* Selects one of the supported REGHC modes.
*
* \param
* mode - PMIC or Pass Transistor
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcSelectMode(cy_en_syspm_reghc_mode_t mode);

