zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_ReghcGetMode
****************************************************************************//**
*
* Gets the supported REGHC modes.
*
* \return \ref cy_en_syspm_reghc_mode_t
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
cy_en_syspm_reghc_mode_t Cy_SysPm_ReghcGetMode(void);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcSelectDriveOut
****************************************************************************//**
*
* Selects DRV_OUT setting.
*
* \param
* drvOut - \ref cy_en_syspm_reghc_drive_out_t
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcSelectDriveOut(cy_en_syspm_reghc_drive_out_t drvOut);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcGetDriveOut
****************************************************************************//**
*
* Gets the DRV_OUT setting.
*
* \return \ref cy_en_syspm_reghc_drive_out_t
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
cy_en_syspm_reghc_drive_out_t Cy_SysPm_ReghcGetDriveOut(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcAdjustOutputVoltage
****************************************************************************//**
*
* Selects regulator output voltage adjustment.
*
* \param
* trim - \ref cy_en_syspm_reghc_vadj_t
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcAdjustOutputVoltage(cy_en_syspm_reghc_vadj_t trim);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcDisableIntSupplyWhileExtActive
****************************************************************************//**
*
*  Internal Active Linear Regulator disabled after PMIC enabled.  OCD is disabled.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcDisableIntSupplyWhileExtActive(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcEnableIntSupplyWhileExtActive
****************************************************************************//**
*
*   Internal Active Linear Regulator kept enabled.  See datasheet for minimum
*   PMIC vccd input to prevent OCD.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcEnableIntSupplyWhileExtActive(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcDisablePmicEnableOutput
****************************************************************************//**
*
* Disables "PMIC enable" output.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcDisablePmicEnableOutput(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcEnablePmicEnableOutput
****************************************************************************//**
*
* Enables "PMIC enable" output.
*
* \param
* polarity => true - output high, false - output low.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcEnablePmicEnableOutput(bool polarity);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcEnablePmicStatusInput
****************************************************************************//**
*
* Enables receiving status from PMIC.
*
* \param
* polarity => true/false -> receiving high/low means abnormal status.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcEnablePmicStatusInput(bool polarity);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcDisablePmicStatusInput
****************************************************************************//**
*
* Disables PMIC status input
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcDisablePmicStatusInput(void);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcSetPmicStatusWaitTime
****************************************************************************//**
*
* Wait count in 4us steps after PMIC status ok. This is used by the hardware
* sequencer to allow additional settling time before disabling the internal
* regulator.
* The LSB is 32 IMO periods which results in a nominal LSB step of 4us.
*
* \param
* waitTime = 0 to 1023 -> (waitTime * 4us) Delay
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcSetPmicStatusWaitTime(uint16_t waitTime);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcIsConfigured
****************************************************************************//**
*
* Indicates that the REGHC has been configured.
* Do not change REGHC settings after this bit is high.
*
* \return
* true - Configured, false - Not configured
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
bool Cy_SysPm_ReghcIsConfigured(void);


