zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_ReghcSetConfigured
****************************************************************************//**
*
* Set REGHC is configured. This is required to apply setting before enabling REGHC.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcSetConfigured(void);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcDisable
****************************************************************************//**
*
* Disables REGHC.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcDisable(void);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcEnable
****************************************************************************//**
*
* Enables REGHC.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcEnable(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcDisablePmicStatusTimeout
****************************************************************************//**
*
* Disables timeout when waiting for REGHC_PMIC_STATUS_OK.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcDisablePmicStatusTimeout(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcEnablePmicStatusTimeout
****************************************************************************//**
*
* Enables timeout while waiting for REGHC_PMIC_STATUS_OK==1 when switching to PMIC.
* Timeout expiration triggers reset.
*
* \param
* timeout = 1 - 255 -> (timeout * 128us) delay until reset
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcEnablePmicStatusTimeout(uint8_t timeout);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcIsEnabled
****************************************************************************//**
*
* Indicates the state of the REGHC enable/disable sequencer.  This bit is only
* valid when REGHC_SEQ_BUSY==0.
*
* \return
* true - Enabled, false - Disabled
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
bool Cy_SysPm_ReghcIsEnabled(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcIsStatusOk
****************************************************************************//**
*
* Indicates the PMIC status is ok.  This includes polarity adjustment according
* to REGHC_PMIC_STATUS_POLARITY.
*
* \return
* false: PMIC status is not ok or PMIC input is disabled (PMIC_STATUS_INEN == 0)
* true:  PMIC status input is enabled and indicates ok
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
bool Cy_SysPm_ReghcIsStatusOk(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcIsSequencerBusy
****************************************************************************//**
*
* Indicates whether the REGHC circuit is busy. Indicates the REGHC enable/disable
* sequencer is busy transitioning to/from REGHC.
*
* \return
* true:  REGHC busy
* false: REGHC not busy
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
bool Cy_SysPm_ReghcIsSequencerBusy(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcDisableVAdj
****************************************************************************//**
*
* Device does not generate VADJ, and it must not be part of the PMIC feedback loop.
* This reduces current by turning off the internal resistor divider that generates
* VADJ.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcDisableVAdj(void);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcEnableVAdj
****************************************************************************//**
*
* Device generates VADJ when PMIC is enabled.  This allows the feedback loop to
* compensate for voltage drops in the PCB and package.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcEnableVAdj(void);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcDisablePmicInDeepSleep
****************************************************************************//**
*
* Device operates from internal regulators during DEEPSLEEP.  If PMIC is enabled
* at the beginning of the DEEPSLEEP transition, hardware changes to the internal
* regulators and disables the PMIC.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcDisablePmicInDeepSleep(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcEnablePmicInDeepSleep
****************************************************************************//**
*
* DEEPSLEEP transition does not change PMIC enable.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_ReghcEnablePmicInDeepSleep(void);

