zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_ReghcIsOcdWithinLimits
****************************************************************************//**
*
* Indicates the over-current detector is operating and the current drawn from
* REGHC is within limits.  OCD is only a choice for transistor mode, and it is
* disabled for PMIC mode.
*
* \return
* false: Current measurement exceeds limit or detector is OFF,
* true:  Current measurement within limit
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
bool Cy_SysPm_ReghcIsOcdWithinLimits(void);


/*******************************************************************************
* Function Name: Cy_SysPm_ReghcIsCircuitEnabledAndOperating
****************************************************************************//**
*
* Indicates the REGHC circuit is enabled and operating.
*
* \return
* false: REGHC Disabled
* true:  REGHC Enabled and Operating
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
bool Cy_SysPm_ReghcIsCircuitEnabledAndOperating(void);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcConfigure
****************************************************************************//**
*
* Configures REGHC.
*
* \param mode \ref cy_en_syspm_reghc_mode_t.
*
* \param vadj \ref cy_en_syspm_reghc_vadj_t.
*
* \return
* - CY_SYSPM_SUCCESS - REGHC Configured Successfully
* - CY_SYSPM_TIMEOUT - REGHC Configuration Failed
*
* \note
* This API is available for CAT1C devices.
*
* \note
* This API takes care of the sequence needed for changing from Linear
* Regulator to REGHC with External Transistor, this API do not support changing to
* REGHC with External PMIC.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_ReghcConfigure(cy_en_syspm_reghc_mode_t mode, cy_en_syspm_reghc_vadj_t vadj);

/*******************************************************************************
* Function Name: Cy_SysPm_ReghcDeConfigure
****************************************************************************//**
*
* De-Configures REGHC.
*
* \return
* - CY_SYSPM_SUCCESS - REGHC De-Configured Successfully
* - CY_SYSPM_TIMEOUT - REGHC De-Configuration Failed
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_ReghcDeConfigure(void);


#endif  /* (SRSS_S40E_REGHC_PRESENT == 1u) || (SRSS_S40E_HTREGHC_PRESENT == 1u) || defined (CY_DOXYGEN) */
/** \} group_syspm_functions_reghc */


/**
* \addtogroup group_syspm_functions_ovd
* \{
*/
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))  || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysPm_OvdEnable
****************************************************************************//**
*
*  Enables OVD over either VDDD or VDDA or VCCD.
*
*  \param ovdSel \ref cy_en_syspm_ovd_sel_t.
*
* \note
* This API is available for CAT1C devices.
*
* \note
* OVD over VDDD and VCCD are enabled by default and cannot be disabled.
*
*******************************************************************************/
void Cy_SysPm_OvdEnable(cy_en_syspm_ovd_sel_t ovdSel);



/*******************************************************************************
* Function Name: Cy_SysPm_OvdDisable
****************************************************************************//**
*
*  Disables OVD over either VDDD or VDDA or VCCD.
*
*  \param ovdSel \ref cy_en_syspm_ovd_sel_t.
*
* \note
* This API is available for CAT1C devices.
*
* \note
* OVD over VDDD and VCCD are enabled by default and cannot be disabled.
*
* \note
* Disabling OVD over VDDA will perform the /ref cy_en_syspm_ovd_action_select_t
* action selected for VDDA. If no action is desired when disabling, firmware
* must first write CY_SYSPM_OVD_ACTION_NOTHING in a separate write cycle.
*
*******************************************************************************/
void Cy_SysPm_OvdDisable(cy_en_syspm_ovd_sel_t ovdSel);



/*******************************************************************************
* Function Name: Cy_SysPm_OvdVdddSelect
****************************************************************************//**
*
*  Selects voltage threshold for OVD on VDDD
*
*  \param ovdVdddSel \ref cy_en_syspm_ovd_vddd_sel_t.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_OvdVdddSelect(cy_en_syspm_ovd_vddd_sel_t ovdVdddSel);


/*******************************************************************************
* Function Name: Cy_SysPm_OvdVddaSelect
****************************************************************************//**
*
*  Selects voltage threshold for OVD on VDDA
*
*  \param ovdVddaSel \ref cy_en_syspm_ovd_vdda_sel_t.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_OvdVddaSelect(cy_en_syspm_ovd_vdda_sel_t ovdVddaSel);


/*******************************************************************************
* Function Name: Cy_SysPm_OvdActionSelect
****************************************************************************//**
*
*  Sets the action taken when the threshold is crossed in the programmed directions(s)
* for VDDA.
*
*  \param ovdActionSelect \ref cy_en_syspm_ovd_action_select_t.
*
* \note
* This API is available for CAT1C devices.
*
* \note
* This API is not applicable for selectng actions for VDDD and VCCD as the default
* action is RESET for them.
*
*******************************************************************************/
void Cy_SysPm_OvdActionSelect(cy_en_syspm_ovd_action_select_t ovdActionSelect);

#endif

/** \} group_syspm_functions_ovd */

/**
* \addtogroup group_syspm_functions_bod
* \{
*/
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))
/*******************************************************************************
* Function Name: Cy_SysPm_BodEnable
****************************************************************************//**
*
*  Enables BOD over either VDDD or VDDA or VCCD.
*
*  \param bodSel \ref cy_en_syspm_bod_sel_t.
*
* \note
* This API is available for CAT1C devices.
*
* \note
* BOD over VDDD and VCCD are enabled by default and cannot be disabled.
*
*******************************************************************************/
void Cy_SysPm_BodEnable(cy_en_syspm_bod_sel_t bodSel);

