zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_BodDisable
****************************************************************************//**
*
*  Disables BOD over either VDDD or VDDA or VCCD.
*
*  \param bodSel \ref cy_en_syspm_bod_sel_t.
*
* \note
* This API is available for CAT1C devices.
*
* \note
* BOD over VDDD and VCCD are enabled by default and cannot be disabled.
*
* \note
* Disabling BOD over VDDA will perform the /ref cy_en_syspm_bod_action_select_t
* action selected for VDDA. If no action is desired when disabling, firmware
* must first write CY_SYSPM_BOD_ACTION_NOTHING in a separate write cycle.
*
*******************************************************************************/
void Cy_SysPm_BodDisable(cy_en_syspm_bod_sel_t bodSel);


/*******************************************************************************
* Function Name: Cy_SysPm_BodVdddSelect
****************************************************************************//**
*
*  Selects voltage threshold for BOD on VDDD
*
*  \param bodVdddSel \ref cy_en_syspm_bod_vddd_sel_t.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_BodVdddSelect(cy_en_syspm_bod_vddd_sel_t bodVdddSel);


/*******************************************************************************
* Function Name: Cy_SysPm_BodVddaSelect
****************************************************************************//**
*
*  Selects voltage threshold for BOD on VDDA
*
*  \param bodVddaSel \ref cy_en_syspm_bod_vdda_sel_t.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
 void Cy_SysPm_BodVddaSelect(cy_en_syspm_bod_vdda_sel_t bodVddaSel);


/*******************************************************************************
* Function Name: Cy_SysPm_BodActionSelect
****************************************************************************//**
*
*  Sets the action taken when the threshold is crossed in the programmed directions(s)
* for VDDA.
*
*  \param bodActionSelect \ref cy_en_syspm_bod_action_select_t.
*
* \note
* This API is available for CAT1C devices.
*
* \note
* This API is not applicable for selectng actions for VDDD and VCCD as the default
* action is RESET for them.
*
*******************************************************************************/
void Cy_SysPm_BodActionSelect(cy_en_syspm_bod_action_select_t bodActionSelect);


/*******************************************************************************
* Function Name: Cy_SysPm_SupplySupervisionStatus
****************************************************************************//**
*
* Supply Status.
*
* \param supplyEntitySelect \ref cy_en_syspm_supply_entity_select_t.

* \return
* State of BOD/OVD on VDDD/VDDA/VCCD, whether OK or Not OK
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
bool Cy_SysPm_SupplySupervisionStatus(cy_en_syspm_supply_entity_select_t supplyEntitySelect);

#endif

/** \} group_syspm_functions_bod */


/**
* \addtogroup group_syspm_functions_buck
* \{
*/

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_BuckEnable
****************************************************************************//**
*
* Switch the core supply regulator to Buck core regulator instead of the LDO
* regulator.
* The Buck core regulator provides output voltage(s) using one external
* inductor and can supply Vccd with higher efficiency than the LDO under some
* conditions, such as high external supply voltage.
*
* Before changing from LDO to Buck, ensure that the circuit board has
* connected Vccbuck1 to Vccd and also populated the
* necessary external components for the Buck regulator, including an
* inductor and a capacitor for each output.
* Refer to the device TRM for more detail.
*
* When changing from a higher voltage to a lower voltage
* (from system LP = LDO 1.1 V (nominal) to system ULP = Buck 0.9 V (nominal)),
* ensure that:
* * The device maximum operating frequency for all the Clk_HF paths, peripheral,
*   and slow clock are under the \ref group_syspm_ulp_limitations.
* * The total current consumption is under the \ref group_syspm_ulp_limitations.
*
* * The appropriate wait states values are set for the flash using
*   the Cy_SysLib_SetWaitStates() function as explained below.
*
* <b>Setting wait states values for flash</b>
*
* The flash access time when the core output voltage is 0.9 V (nominal) is
* longer than at 1.1 V (nominal). Therefore, the number of the wait states must
* be adjusted. Use the Cy_SysLib_SetWaitStates() function to set the appropriate
* wait state values for flash.
*
* To change from a higher voltage (LDO 1.1 V) to a lower voltage (Buck 0.9 V),
* call the Cy_SysLib_SetWaitStates(true, hfClkFreqMz) function before changing
* the voltage, where hfClkFreqMz is the frequency of HfClk0 in MHz.
*
* To change from a lower voltage (LDO 0.9 V (nominal) to a higher voltage
* (Buck 1.1 V (nominal)), call the Cy_SysLib_SetWaitStates(false,
* hfClkFreqMz) function to set the wait states after the voltage change.
* It is optional, but can be done to improve performance. The clock frequency
* may now be increased up to system LP mode limits for the new voltage.
*
* \note 1. If the final Buck output is set to 0.9 V (nominal) - the system is in
*  ULP mode and flash allows read-only operations.
* \note 2. If the final Buck output is set to 1.1 V (nominal) - the system is in
*  LP mode flash allows the read and write operations.
* \note 3. The actual device Vccd voltage can be different from the nominal
*  voltage because the actual voltage value depends on conditions
*  including the load current.
*
* \warning There is no safe way to go back to the LDO after the
*  Buck regulator supplies a core. The function enabling the Buck regulator
*  switches off the LDO.
*
* \warning Buck converter requires additional external components populated on
* dedicated pins. Refer to device datasheet for details.
*
* For more detail, refer to the \ref group_syspm_switching_into_ulp and
* \ref group_syspm_switching_into_lp sections.
* Refer to the \ref group_syslib driver for more detail about setting wait
* states.
*
* \param voltage
* The desired output 1 regulator voltage (Vccbuck1).
* See \ref cy_en_syspm_buck_voltage1_t.
*
* \return
* - CY_SYSPM_SUCCESS - The voltage is set as requested.
*   (There is no change if the new voltage is the same as the previous voltage.)
* - CY_SYSPM_INVALID_STATE - The voltage was not set. The voltage cannot be set
*   because the protection context value is higher than zero (PC > 0) or the
*   device revision does not support modifying registers via syscall.
* - CY_SYSPM_CANCELED - Operation was canceled. Call the function again until
*   the function returns CY_SYSPM_SUCCESS. See \ref cy_en_syspm_status_t.
*   For the PSoC 64 devices there are possible situations when function returns
*   the PRA error status code. This is because for PSoC 64 devices the function
*   uses the PRA driver to change the protected registers. Refer to
*   \ref cy_en_pra_status_t for more details.
*
* \note
* The function is applicable only for devices with a Buck regulator.
*
* Function uses a critical section to prevent interrupting the regulators
* switch.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_BuckEnable
*
* \note
* This API is available for CAT1A devices.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_BuckEnable(cy_en_syspm_buck_voltage1_t voltage);


