zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_IsSystemUlp
****************************************************************************//**
*
* Checks if the system is in ULP mode.
*
* \return
* - True the system is in ULP mode.
* - False the system is is not ULP mode.
*
* \note
* This API is available for CAT1A, CAT1B(PSOC C3) and CAT1D devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_IsSystemUlp
*
*******************************************************************************/
bool Cy_SysPm_IsSystemUlp(void);
#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN) */

#if defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) ||defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_IsSystemLp
****************************************************************************//**
*
* Checks if the system is in LP mode.
*
* \return
* - True the system is in LP mode.
* - False the system is not in LP mode.
*
* \note
* This API is available for CAT1A, CAT1B(PSOC C3), CAT1C & CAT1D devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_IsSystemLp
*
*******************************************************************************/
bool Cy_SysPm_IsSystemLp(void);
#endif


#if (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_IsSystemMf
****************************************************************************//**
*
* Checks if the system is in MF mode.
*
* \return
* - True the system is in MF mode.
* - False the system is not in MF mode.
*
* \note
* This API is available for CAT1B(PSOC C3) devices only.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_IsSystemMf
*
*******************************************************************************/
bool Cy_SysPm_IsSystemMf(void);
#endif

#if defined (CY_IP_MXS22SRSS)  || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysPm_IsSystemHp
****************************************************************************//**
*
* Checks if the system is in HP mode.
*
* \return
* - True the system is in HP mode.
* - False the system is not in HP mode.
*
* \note
* This API is available for CAT1D devices only.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_IsSystemHp
*
*******************************************************************************/
bool Cy_SysPm_IsSystemHp(void);


#endif



#if (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL))
/*******************************************************************************
* Function Name: Cy_SysPm_IsSystemOd
****************************************************************************//**
*
* Checks if the system is in OD mode.
*
* \return
* - True the system is in OD mode.
* - False the system is not in OD mode.
*
* \note
* This API is available for CAT1B(PSOC C3)devices only.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_IsSystemOd
*
*******************************************************************************/
bool Cy_SysPm_IsSystemOd(void);
#endif

#endif


#if defined (CY_IP_MXS40SRSS)  || defined (CY_DOXYGEN)

#if (defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS == 1u)) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysPm_Cm4IsActive
****************************************************************************//**
*
* Checks if CM4 is in CPU Active mode.
*
* \return
* - True if CM4 is in CPU Active mode.
* - False if the CM4 is not in CPU Active mode.
*
* \note
* This API is available for CAT1A devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_Cm4IsActive
*
*******************************************************************************/
bool Cy_SysPm_Cm4IsActive(void);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm4IsSleep
****************************************************************************//**
*
* Checks if the CM4 is in CPU Sleep mode.
*
* \return
* - True if the CM4 is in CPU Sleep mode.
* - False if the CM4 is not in CPU Sleep mode.
*
* \note
* This API is available for CAT1A devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_Cm4IsSleep
*
*******************************************************************************/
bool Cy_SysPm_Cm4IsSleep(void);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm4IsDeepSleep
****************************************************************************//**
*
* Checks if the CM4 is in the CPU Deep Sleep mode.
*
* \return
* - True if CM4 is in CPU Deep Sleep mode.
* - False if the CM4 is not CPU in Deep Sleep mode.
*
* \note
* This API is available for CAT1A devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_Cm4IsDeepSleep
*
*******************************************************************************/
bool Cy_SysPm_Cm4IsDeepSleep(void);

#endif  /* (defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS == 1u)) || defined (CY_DOXYGEN) */

/*******************************************************************************
* Function Name: Cy_SysPm_Cm0IsActive
****************************************************************************//**
*
* Checks if the CM0+ is in CPU Active mode.
*
* \return
* - True if the CM0+ is in CPU Active mode.
* - False if the CM0+ is not in CPU Active mode.
*
* \note
* This API is available for CAT1A & CAT1C devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_Cm0IsActive
*
*******************************************************************************/
bool Cy_SysPm_Cm0IsActive(void);


