zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_Cm0IsSleep
****************************************************************************//**
*
* Checks if the CM0+ is in CPU Sleep mode.
*
* \return
* - True if the CM0+ is in CPU Sleep mode.
* - False if the CM0+ is not in CPU Sleep mode.
*
* \note
* This API is available for CAT1A & CAT1C devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_Cm0IsSleep
*
*******************************************************************************/
bool Cy_SysPm_Cm0IsSleep(void);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm0IsDeepSleep
****************************************************************************//**
*
* Checks if the CM0+ is in CPU Deep Sleep mode.
*
* \return
* - True if the CM0+ is in CPU Deep Sleep mode
* - False if the CM0+ is not in CPU Deep Sleep mode
*
* \note
* This API is available for CAT1A & CAT1C devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_Cm0IsDeepSleep
*
*******************************************************************************/
bool Cy_SysPm_Cm0IsDeepSleep(void);

#if (CY_IP_MXS40SRSS_VERSION >= 2)
/*******************************************************************************
* Function Name: Cy_SysPm_IsBgRefCtrl
****************************************************************************//**
*
* Get the power mode status of Bandgap Ref Circuits
*
* \return
* true - Bandgap Ref Circuits power mode is enabled,
* false - Bandgap Ref Circuits power mode is disabled.
*
* \note
* This API is available for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
bool Cy_SysPm_IsBgRefCtrl(void);

/*******************************************************************************
* Function Name: Cy_SysPm_BgRefCtrl
****************************************************************************//**
*
* Enables/Disables powers mode of Bandgap Ref Circuits
*
* \param enable
* true - to enable, false - to disable
*
* \note
* This API is available for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
void Cy_SysPm_BgRefCtrl(bool enable);

#endif /* (CY_IP_MXS40SRSS_VERSION >= 2) */

#endif /* defined (CY_IP_MXS40SRSS)  || defined (CY_DOXYGEN) */

#if defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysPm_Cm33IsActive
****************************************************************************//**
*
* Checks if CM33 is in the active mode.
*
* \note
* This API is available for CAT1D devices.
*
* \return
* true - if CM33 is in the active mode, false - if the CM33 is not in active mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm33IsActive(void);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm33IsSleep
****************************************************************************//**
*
* Checks if the CM33 is in the sleep mode.
*
* \note
* This API is available for CAT1D devices.
*
* \return
* true - if the CM33 is in the sleep mode,
* false - if the CM33 is not in the sleep mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm33IsSleep(void);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm33IsDeepSleep
****************************************************************************//**
*
* Checks if the CM33 is in the deep sleep mode.
*
* \return
* true - if CM33 is in the deep sleep mode, false - if the CM33 is not in
* the deep sleep mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm33IsDeepSleep(void);

/*******************************************************************************
* Function Name: Cy_SysPm_Cm55IsActive
****************************************************************************//**
*
* Checks if CM55 is in the active mode.
*
* \note
* This API is available for CAT1D devices.
*
* \return
* true - if CM55 is in the active mode, false - if the CM55 is not in active mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm55IsActive(void);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm55IsSleep
****************************************************************************//**
*
* Checks if the CM55 is in the sleep mode.
*
* \note
* This API is available for CAT1D devices.
*
* \return
* true - if the CM55 is in the sleep mode,
* false - if the CM55 is not in the sleep mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm55IsSleep(void);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm55IsDeepSleep
****************************************************************************//**
*
* Checks if the CM55 is in the deep sleep mode.
*
* \return
* true - if CM55 is in the deep sleep mode, false - if the CM55 is not in
* the deep sleep mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm55IsDeepSleep(void);

#endif


#if (defined (CY_IP_M7CPUSS) && (CY_IP_M7CPUSS == 1u)) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_Cm7IsActive
****************************************************************************//**
*
* Checks if CM7 is in the active mode.
*
* \param core
* Selects the core, 0 for CM7_0, 1 for CM7_1
*
* \note
* This API is available for CAT1C devices.
*
* \return
* true - if CM7 is in the active mode, false - if the CM7 is not in active mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm7IsActive(uint8_t core);


