zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_Cm7IsSleep
****************************************************************************//**
*
* Checks if the CM7 is in the sleep mode.
*
* \param core
* Selects the core, 0 for CM7_0, 1 for CM7_1
*
* \note
* This API is available for CAT1C devices.
*
* \return
* true - if the CM7 is in the sleep mode,
* false - if the CM7 is not in the sleep mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm7IsSleep(uint8_t core);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm7IsDeepSleep
****************************************************************************//**
*
* Checks if the CM7 is in the deep sleep mode.
*
* \param core
* Selects the core, 0 for CM7_0, 1 for CM7_1
*
* \return
* true - if CM7 is in the deep sleep mode, false - if the CM7 is not in
* the deep sleep mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm7IsDeepSleep(uint8_t core);


#endif
/** \} group_syspm_functions_power_status */


/**
* \addtogroup group_syspm_functions_power
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysPm_CpuSendWakeupEvent
****************************************************************************//**
*
* Sends the SEV (Send Event) ARM instruction to the system.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_CpuSendWakeupEvent
*
*******************************************************************************/
void Cy_SysPm_CpuSendWakeupEvent(void);


#if defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysPm_SystemIsMinRegulatorCurrentSet
****************************************************************************//**
*
* Check whether the system regulator is set to minimal current mode.
*
* \return
* - True - system is in regulator minimum current mode.
* - False - system is in normal regulator current mode.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_SystemSetNormalRegulatorCurrent
*
*******************************************************************************/
bool Cy_SysPm_SystemIsMinRegulatorCurrentSet(void);
#endif /* defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN) */
/** \} group_syspm_functions_power */


#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || defined (CY_DOXYGEN)
/**
* \addtogroup group_syspm_functions_buck
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysPm_BuckIsEnabled
****************************************************************************//**
*
* Get the current status of the Buck regulator.
*
* \return
* - True if the Buck regulator is enabled.
* - False if it is disabled.
*
* \note
* This API is available for CAT1A devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_VoltageRegulator
*
*******************************************************************************/
bool Cy_SysPm_BuckIsEnabled(void);


/*******************************************************************************
* Function Name: Cy_SysPm_BuckGetVoltage1
****************************************************************************//**
*
* Gets the current nominal output 1 voltage (Vccbuck1) of
* the Buck regulator.
*
* \note The actual device output 1 voltage (Vccbuck1) can be different from
* the nominal voltage because the actual voltage value depends on conditions
* including load current.
*
* \return
* The nominal output voltage 1 (Vccbuck1) of the Buck regulator.
* See \ref cy_en_syspm_buck_voltage1_t.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_VoltageRegulator
*
* \note
* This API is available for CAT1A devices.
*
*
*******************************************************************************/
cy_en_syspm_buck_voltage1_t Cy_SysPm_BuckGetVoltage1(void);

/*******************************************************************************
* Function Name: Cy_SysPm_BuckGetVoltage2
****************************************************************************//**
*
* Gets the current output 2 nominal voltage (Vbuckrf) of the SIMO
* Buck regulator.
*
* \note The actual device output 2 voltage (Vbuckrf) can be different from the
* nominal voltage because the actual voltage value depends on conditions
* including load current.
*
* \return
* The nominal output voltage of the Buck SIMO regulator output 2
* voltage (Vbuckrf). See \ref cy_en_syspm_buck_voltage2_t.
*
* \note
* Function returns zero for devices without a SIMO Buck regulator.
* Refer to the device datasheet about information on whether device contains
* a SIMO Buck.
*
* \note
* This API is available for CAT1A devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_BuckGetVoltage2
*
*******************************************************************************/
cy_en_syspm_buck_voltage2_t Cy_SysPm_BuckGetVoltage2(void);

/*******************************************************************************
* Function Name: Cy_SysPm_BuckDisableVoltage2
****************************************************************************//**
*
* Disables the output 2 voltage (Vbuckrf) of the SIMO Buck regulator. The
* output 2 voltage (Vbuckrf) of the Buck regulator is typically used to supply
* the BLE radio.
*
* \note The function does not have effect, if the Buck regulator is
* switched off.
*
* \note If you are switching the voltage supply source for BLE radio, ensure
* that the new voltage supply for the BLE HW block is settled
* and is stable before calling the Cy_SysPm_BuckDisableVoltage2() function.
*
* This function is applicable for devices with the SIMO Buck regulator.
* Refer to the device datasheet for information about whether the device
* contains a SIMO Buck.
*
* \note
* This API is available for CAT1A devices.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_BuckDisableVoltage2
*
*******************************************************************************/
void Cy_SysPm_BuckDisableVoltage2(void);

