zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckDpslpSetMode
****************************************************************************//**
*
* Set the Deepsleep Core Buck Regulator mode
*
* \param mode
* Pick from \ref cy_en_syspm_core_buck_mode_t
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
void Cy_SysPm_CoreBuckDpslpSetMode(cy_en_syspm_core_buck_mode_t mode);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckDpslpGetMode
****************************************************************************//**
*
* Get the Deepsleep Core Buck Regulator Mode
*
* \return
* Gets enum value of type \ref cy_en_syspm_core_buck_mode_t
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
cy_en_syspm_core_buck_mode_t Cy_SysPm_CoreBuckDpslpGetMode(void);


/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckDpslpEnableOverride
****************************************************************************//**
*
* Enable the Override feature for core buck during Deepsleep
*
* \param enable
* true - enable, false - disable
*
* \note
* This function is available for CAT1D devices.
*
*******************************************************************************/
void Cy_SysPm_CoreBuckDpslpEnableOverride(bool enable);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckDpslpIsOverrideEnabled
****************************************************************************//**
*
* Checks if Override feature of core buck during deepsleep is enabled or not.
*
* \return
* True if enabled, False if disabled.
*
* \note
* This function is available for CAT1D devices.
*
*******************************************************************************/
bool Cy_SysPm_CoreBuckDpslpIsOverrideEnabled(void);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckSetProfile
****************************************************************************//**
*
* Set the Core Buck Regulator Profile
*
* \param profile
* Pick from \ref cy_en_syspm_core_buck_profile_t
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
void Cy_SysPm_CoreBuckSetProfile(cy_en_syspm_core_buck_profile_t profile);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckGetProfile
****************************************************************************//**
*
* Get the Core Buck Regulator Profile
*
* \return
* Gets enum value of type \ref cy_en_syspm_core_buck_profile_t
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
cy_en_syspm_core_buck_profile_t Cy_SysPm_CoreBuckGetProfile(void);

/*******************************************************************************
* Function Name: Cy_SysPm_RetLdoStatus
****************************************************************************//**
*
* Get the status of RETLDO Regulator
*
* \return
* Gets enum value of type \ref cy_en_syspm_status_t
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_RetLdoStatus(void);

/*******************************************************************************
* Function Name: Cy_SysPm_RetLdoConfigure
****************************************************************************//**
*
* Configures the RETLDO Regulator
*
* \param retLdoParam
* Structure containing the config parameters, \ref cy_stc_syspm_retldo_params_t
*
* \note
* This API is available for CAT1D devices.
*
* \return
* see \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_RetLdoConfigure(cy_stc_syspm_retldo_params_t *retLdoParam);

/*******************************************************************************
* Function Name: Cy_SysPm_SramLdoStatus
****************************************************************************//**
*
* Get the status of SRAMLDO Regulator
*
* \return
* Gets enum value of type \ref cy_en_syspm_status_t
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SramLdoStatus(void);

/*******************************************************************************
* Function Name: Cy_SysPm_SramLdoConfigure
****************************************************************************//**
*
* Configures the SRAMLDO Regulator
*
* \param sramLdoParam
* Structure containing the config parameters, \ref cy_stc_syspm_sramldo_params_t
*
* \note
* This API is available for CAT1D devices.
*
* \return
* see \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SramLdoConfigure(cy_stc_syspm_sramldo_params_t *sramLdoParam);

/*******************************************************************************
* Function Name: Cy_SysPm_SramLdoEnable
****************************************************************************//**
*
* Enable/Disable SRAMLDO Regulator
*
* \param enable
* true - enable, false - disable
*
* \note
* This API is available for CAT1D devices.
*
* \return
* see \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_SramLdoEnable(bool enable);

/*******************************************************************************
* Function Name: Cy_SysPm_SramLdoSetVoltage
****************************************************************************//**
*
* Set SRAM LDO Voltage
*
* \param voltage
* Enum \ref cy_en_syspm_sramldo_voltage_t
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
void Cy_SysPm_SramLdoSetVoltage(cy_en_syspm_sramldo_voltage_t voltage);

