zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_SramLdoGetVoltage
****************************************************************************//**
*
* Get the SRAM LDO Voltage
*
* \return
* Gets enum value of type \ref cy_en_syspm_sramldo_voltage_t
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
cy_en_syspm_sramldo_voltage_t Cy_SysPm_SramLdoGetVoltage(void);

/*******************************************************************************
* Function Name: Cy_SysPm_MiscLdoStatus
****************************************************************************//**
*
* Get the status of MISCLDO Regulator
*
* \return
* Gets enum value of type \ref cy_en_syspm_status_t
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_MiscLdoStatus(void);

/*******************************************************************************
* Function Name: Cy_SysPm_MiscLdoConfigure
****************************************************************************//**
*
* Configures the MISCLDO Regulator
*
* \param miscLdoParam
* Structure containing the config parameters, \ref cy_stc_syspm_miscldo_params_t
*
* \note
* This API is available for CAT1D devices.
*
* \return
* see \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_MiscLdoConfigure(cy_stc_syspm_miscldo_params_t *miscLdoParam);



#endif /* defined (CY_IP_MXS22SRSS)  || defined (CY_DOXYGEN) */


#if defined (CY_IP_MXS40SSRSS)  || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckSetInrushLimit
****************************************************************************//**
*
* Set the Core Buck Inrush Limit
*
* \param inrushLimit
* Pick from \ref cy_en_syspm_core_inrush_limit_t
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_CoreBuckSetInrushLimit(cy_en_syspm_core_inrush_limit_t inrushLimit);


/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckGetInrushLimit
****************************************************************************//**
*
* Get the Core Buck Inrush Limit
*
* \return
* Gets enum value of type \ref cy_en_syspm_core_inrush_limit_t
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
cy_en_syspm_core_inrush_limit_t Cy_SysPm_CoreBuckGetInrushLimit(void);


/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckConfig
****************************************************************************//**
*
* Configures the Core Buck Regulator
*
* \note
* Core buck voltage and mode are selected based on a voting system by the
* following 5 requesters
* Deepsleep Requester, SDR0 DS Requester, SDR0 Requester, SDR1 Requester and
* Extra Requester.
* The requesters may all request different voltages and CBUCK modes.
* When multiple requesters are used for a profile, the requests are harmonized
* into a composite request according to rules:
*  - The composite CBUCK voltage request is the maximum voltage from all
*    enabled requesters.
*  - The composite CBUCK mode is the maximum setting among all enabled requesters
*    to get the highest mode.
*
* For information about the CBUCK control, refer to the appropriate device TRM.
*
* \param config
* Structure containing the config parameters, \ref cy_stc_syspm_core_buck_params_t
*
* \note
* This API is available for CAT1B devices.
*
* \return
* see \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_CoreBuckConfig(cy_stc_syspm_core_buck_params_t *config);

/*******************************************************************************
* Function Name: Cy_SysPm_LdoExtraRequesterConfig
****************************************************************************//**
*
* Configures the Extra Requester for Core Buck Regulator
*
* \note
* The extra requester caters to two special cases:
*   - To temporarily force the system to choose a scratch profile with the
*     settings defined by the extra requester.  This allows other requester
*     settings to be changed without changing the internal setting of an active
*     profile.  This can be used to change the target voltage of an enabled
*     stepdown regulator.
*   - To participate in requester harmonization as an extra requester.
*     This can be used to restrict the composite settings higher than the
*     hardware would normally choose according to the harmonization rules.
*
* For information about the CBUCK control, refer to the appropriate device TRM.
*
* \param extraReqConfig
* Pointer to structure containing the extra requester config parameters,
* \ref cy_stc_syspm_extraReq_params_t
*
* \note
* This API is available for CAT1B devices.
*
* \return
* see \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_LdoExtraRequesterConfig(cy_stc_syspm_extraReq_params_t *extraReqConfig);
#endif /* defined (CY_IP_MXS40SSRSS)  || defined (CY_DOXYGEN) */

#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN) */
/** \} group_syspm_functions_buck */


/**
* \addtogroup group_syspm_functions_ldo
* \{
*/
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL))

/*******************************************************************************
* Function Name: Cy_SysPm_LdoGetVoltage
****************************************************************************//**
*
* Gets the current output voltage value of the core LDO regulator.
*
* \note The actual device Vccd voltage can be different from the
* nominal voltage because the actual voltage value depends on conditions
* including the load current.
*
* \return
* The nominal output voltage of the LDO. See \ref cy_en_syspm_ldo_voltage_t.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_VoltageRegulator
*
* \note
* This API is available for CAT1A devices.
*
*******************************************************************************/
cy_en_syspm_ldo_voltage_t Cy_SysPm_LdoGetVoltage(void);

