zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syspm.h
#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) */

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_LdoIsEnabled
****************************************************************************//**
*
* Reads the current status of the core LDO regulator.
*
* \return
* - True means the LDO is enabled.
* - False means it is disabled.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_VoltageRegulator
*
*******************************************************************************/
bool Cy_SysPm_LdoIsEnabled(void);

#endif  /* defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2) */

#if defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysPm_SdrConfigure
****************************************************************************//**
*
* Configures the SDR(Step Down Regulator)
*
* \note
*  The CBUCK voltage selection must be 60mV higher than the SDR output or the
* regulator output may bypass.
*
* \param sdr
* CY_SYSPM_SDR_0 - for SDR0
* CY_SYSPM_SDR_1 - for SDR1
*
* \param config
* Structure containing the config parameters, \ref cy_stc_syspm_sdr_params_t
*
* \note
* Maintain below conditions when switching th voltages
* High to Low voltage --> Set TRIM's first , Set Voltage next
* Low to High voltage --> Set Voltage first , Set TRIM's next
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_SdrConfigure(cy_en_syspm_sdr_t sdr, cy_stc_syspm_sdr_params_t *config);

/*******************************************************************************
* Function Name: Cy_SysPm_SdrSetVoltage
****************************************************************************//**
*
* Set the SDR(Step Down Regulator) Voltage
*
* \note
*  The CBUCK voltage selection must be 60mV higher than the SDR output or the
* regulator output may bypass.
*
* \param sdr
* CY_SYSPM_SDR_0 - for SDR0
* CY_SYSPM_SDR_1 - for SDR1
*
* \param voltage
* Pick from \ref cy_en_syspm_sdr_voltage_t
*
* \note
* Maintain below conditions when switching th voltages
* High to Low voltage --> Set TRIM's first , Set Voltage next
* Low to High voltage --> Set Voltage first , Set TRIM's next
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_SdrSetVoltage(cy_en_syspm_sdr_t sdr, cy_en_syspm_sdr_voltage_t voltage);


/*******************************************************************************
* Function Name: Cy_SysPm_SdrGetVoltage
****************************************************************************//**
*
* Get the SDR(Step Down Regulator) Voltage
*
* \param sdr
* CY_SYSPM_SDR_0 - for SDR0
* CY_SYSPM_SDR_1 - for SDR1
*
* \return
* Gets Voltage enum value of type \ref cy_en_syspm_sdr_t
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
cy_en_syspm_sdr_voltage_t Cy_SysPm_SdrGetVoltage(cy_en_syspm_sdr_t sdr);

/*******************************************************************************
* Function Name: Cy_SysPm_SdrEnable
****************************************************************************//**
*
* Enable the SDR(Step Down Regulator)
*
* \note
* Applicable for only SDR1, whereas SDR0 is always enabled.
*
* \param sdr
* CY_SYSPM_SDR_0 - for SDR0
* CY_SYSPM_SDR_1 - for SDR1
*
* \param enable
* true - enable, false - disable
*
* \note
* This function is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_SdrEnable(cy_en_syspm_sdr_t sdr, bool enable);

/*******************************************************************************
* Function Name: Cy_SysPm_IsSdrEnabled
****************************************************************************//**
*
* Checks if SDR(Step Down Regulator) is enabled or not.
*
* \param sdr
* CY_SYSPM_SDR_0 - for SDR0
* CY_SYSPM_SDR_1 - for SDR1
*
* \return
* True if enabled, False if disabled.
*
* \note
* This function is available for CAT1B devices.
*
*******************************************************************************/
bool Cy_SysPm_IsSdrEnabled(cy_en_syspm_sdr_t sdr);

/*******************************************************************************
* Function Name: Cy_SysPm_HvLdoConfigure
****************************************************************************//**
*
* Configures the HVLDO Regulator
*
* \param config
* Structure containing the config parameters, \ref cy_stc_syspm_hvldo_params_t
*
* \note
* This function is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_HvLdoConfigure(cy_stc_syspm_hvldo_params_t *config);

/*******************************************************************************
* Function Name: Cy_SysPm_HvLdoSetVoltage
****************************************************************************//**
*
* Set the HVLDO Regulator Voltage
*
* \param voltage
* Pick from \ref cy_en_syspm_hvldo_voltage_t
*
* \note
* This function is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_HvLdoSetVoltage(cy_en_syspm_hvldo_voltage_t voltage);

/*******************************************************************************
* Function Name: Cy_SysPm_HvLdoGetVoltage
****************************************************************************//**
*
* Get the HVLDO Regulator Voltage
*
* \return
* Gets Voltage enum value of type \ref cy_en_syspm_hvldo_voltage_t
*
* \note
* This function is available for CAT1B devices.
*
*******************************************************************************/
cy_en_syspm_hvldo_voltage_t Cy_SysPm_HvLdoGetVoltage(void);

